[
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "SBF’s Prison Currency: Rice Bags for Trade, Says First Interview",
    "category": "FTX Exchange, Sam Bankman-Fried (SBF)",
    "author": "Chayanika Deka",
    "link": "https://cryptopotato.com/sbfs-prison-currency-rice-bags-for-trade-says-first-interview/",
    "creationDate": "May 12, 2024",
    "content": "Disgraced FTX founder Sam Bankman-Fried revealed that he hasn’t experienced abuse and doesn’t “feel unsafe.” The only time he feels bothered is during the night when they ask about the rice bags they plan to use for trade.\nThis was his first comprehensive interview since being imprisoned.\nThe disgraced founder of FTX and co-founder of Alameda Research, who was found guilty of wire fraud, money laundering, and conspiracy in November, now has a new form of currency for trading while in prison at the Metropolitan Detention Center in Brooklyn.\nWhile speaking to Puck News’ William D Cohan in an interview arranged by SBF’s mother – Barbara Fried – the former CEO of the cryptocurrency exchange informed Puck magazine that he survives on beans and bags of rice bought from the commissary and that his rice has become a form of currency within the MDC.\nCohan was not allowed access to a pen, pad, recorder, phone, or watch during the interview, so his observations were noted down afterward.\nAccording to Cohan’s estimate, SBF has lost around 25 pounds and appears to be in better shape. This could be due in part to his claim that the vegan food he receives is so bad that he can’t eat it, and his fellow inmates have described it as smelling awful.\nThe convicted felon also discussed his situation in federal prison and maintained his innocence stance. He even disclosed his intention to appeal the conviction. Bankman-Fried told Cohan he feels he was made a scapegoat for FTX’s collapse, attributing it to negligence that made the company vulnerable to issues like a bank run and competitors’ actions.\nHe believes civil, not criminal, penalties would be appropriate. Cohan observed that despite the conviction, SBF still denies committing any crimes and sees himself as an innocent who didn’t have enough chance to negotiate with prosecutors.\nInstead of being remorseful about the $8 billion in customer funds he was convicted of mishandling, SBF instead claimed that the lawyers he handed FTX to were responsible for the firm’s collapse.\n",
    "referenceLinks": [
      "https://puck.news/exclusive-prison-chat-with-sam-bankman-fried/",
      "https://cryptopotato.com/former-ftx-chief-sam-bankman-fried-sentenced-to-25-years-in-prison/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/ftx_sbf_cover-1-3j3kr6pg97favjxm7xdczu.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Hong Kong Police In Search of Four After Crypto Investor Abduction: Report",
    "category": "Hong Kong",
    "author": "Mandy Williams",
    "link": "https://cryptopotato.com/hong-kong-police-in-search-of-four-after-crypto-investor-abduction-report/",
    "creationDate": "May 12, 2024",
    "content": "The Hong Kong police force is in search of four men who abducted a crypto investor on Tuesday at Tai Lau Leng Village off Po Shek Wu Road in Sheung Shui district.\nAccording to a report by the South China Morning Post, the suspects stopped the 55-year-old woman while she rode in a car with her husband and attacked him with a stun gun when he tried to prevent them from taking her.\nThe unidentified woman was freed around 9:45 pm, roughly an hour after she was taken away in a seven-seater vehicle. She works as a crypto investor, while her 43-year-old spouse owns an information technology firm.\nPeople familiar with the matter said the attack was tied to a HK$15 million (U.S.$1.9 million) crypto investment dispute in which the victim was involved.\nPolice officers eventually got to the incident scene after receiving a report from the victim’s husband. When the woman was released in Ta Kwu Ling, about 4.3 miles from the crime scene, she went to seek help at the nearest police station.\nFurther investigation revealed that the captors were between the ages of 30 and 50, and the woman did not know them. She incurred minor arm and leg injuries while her husband sustained wounds on his head, neck, and limbs.\nWhile the police treat the case as unlawful detention and assault, the couple has been sent to a hospital for treatment. The force has made no arrests so far, and the case was the second abduction the city witnessed within 32 hours.\nHong Kong is currently experiencing a surge in crypto crimes, mostly from financial disputes over digital asset investments.\nLast month, CryptoPotato reported that the Hong Kong police force rescued a 19-year-old who had fallen victim to a harrowing ordeal, apprehending three teenagers who were responsible for the assault and unlawful detention.\nThe victim was subjected to threats and brutal assault with baseball bats over a dispute regarding $23,000 in crypto trading profits. There are nine suspects, but only three were arrested at the crime scene. The police are still in search of the remaining six, comprising four males and two females.\n",
    "referenceLinks": [
      "https://www.scmp.com/news/hong-kong/law-and-crime/article/3261852/manhunt-under-way-after-4-men-abduct-hong-kong-cryptocurrency-investor-attack-husband-stun-gun",
      "https://cryptopotato.com/3-suspects-arrested-as-hong-kong-police-rescue-teen-in-crypto-related-attack-report/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/PoliceArrest-min-3ceqna3t4vqre9shuqca2y.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Here Is What 6 Silicon Valley Giants Think About Cryptocurrency",
    "category": "Blockchain Adoption",
    "author": "W. E. Messamore",
    "link": "https://cryptopotato.com/here-is-what-6-silicon-valley-giants-think-about-cryptocurrency/",
    "creationDate": "May 12, 2024",
    "content": "The high-tech industry continues to make active inroads into the blockchain industry, proposing and building out new solutions that make Web3’s products better and more usable by mainstream folks as well as sophisticated industry participants.\nBack in 2021 at “The B-Word” conference by Crypto Council for Innovation, on a panel alongside Cathie Wood and Elon Musk, Dorsey said,\n“It’s deeply principled, it’s weird as hell [and] it’s always evolving. It just reminded me of the Internet as a kid.”\nYou might say the Twitter, Block, and Bluesky social founder is a fan of Bitcoin and cryptocurrency. The Silicon Valley whiz kid started Block (formerly Square Payments) soon after founding Twitter.\nMoreover, his payments processing company bought CashApp and began offering users easy, hassle-free Bitcoin custody so they could buy BTC with a credit or debit card on their phone.\nJust a few days ago, Twitter Dorsey announced Block had completed the development of its proprietary Bitcoin mining chip. It is an Application Specific Integrated Circuit (ASIC) designed at the hardware level in nanometers to be optimized for nothing other than mining Bitcoin:\n“Our mining chip will utilize the most advanced semiconductor process currently available and will deliver the performance required for mining operators of all types to survive and thrive in the fifth mining epoch (the period following the recent 4th halving of the block subsidy) and beyond.”\nFurthermore, in Block’s Q1 earnings report to investors, a note from Dorsey announced that moving forward, the Oakland, California-based Web3 company will invest 10% of the profits from all Bitcoin-related operations into buying Bitcoin each month.\n“Historically and moving forward, our investment in bitcoin transcends technology; it is an investment in a future where economic empowerment is the norm. This commitment drives our business into new territories, unlocking novel opportunities for our customers, and securing enduring value for you, our shareholders.”\n“What really drove my thinking and drives my passion behind it is, if the Internet has a chance to get a native currency, what would that be? To me, it’s bitcoin because of those principles, because of its resilience,” Dorsey says.\nPayPal founder and Silicon Valley’s winningest investor, Peter Thiel, is a Web3 don. His Founders Fund has held and sold massive whale-sized tranches of Bitcoin for years. His Thiel Foundation helped launch Ethereum in 2014 with a $100,000 grant to Ethereum inventor and founder Vitalik Buterin.\nBitcoin price rallied to a floor above $60K per coin in February after spot Bitcoin ETF issuers in the U.S. got a green light from the SEC in January. The last time BTC traded above $60,000, Thiel gave this cautiously bullish advice while speaking at an event in the Bitcoin Mecca of Miami, Florida:\n“I don’t know that you should put all your money into bitcoin at $60,000 a bitcoin right now. But surely the fact that it is at $60,000 is an extremely hopeful sign. It’s the canary in the coal mine. It’s the most honest market we have in the country.”\n“I feel like I’ve been underinvested in it,” Thiel said at a time every Bitcoin investor felt that way. In the debate over whether investors are still early or too late to Bitcoin, he said, “I think the answers are still to go long… maybe it still is enough of a secret.”\nSince 2021, Thiel’s Founder’s Fund has exhibited excellent timing of massive entries and exits onto and off of the Bitcoin blockchain. The firm revealed at the beginning of 2023 that it had exited a large position in Bitcoin— accumulated over eight years— just before the crypto market collapsed in 2022 after Bitcoin price crashed. There was a string of insolvencies at several major crypto exchanges and other companies that did not competently manage the new currency’s wild market swings over its four-year cycle.\nSources familiar to Reuters revealed in February this year that the fund is back in Bitcoin and Ethereum to the tune of some $200 million over the past year.\nFacebook founder and CEO Mark Zuckerberg has his hands pretty full with Facebook, Instagram, and WhatsApp. But that hasn’t stopped him from making forays into blockchain and virtual reality headsets, even renaming his company Meta to focus its future on cyberspace.\nIn fact, Zuckerberg attempted to launch a cryptocurrency in 2019— Libra Coin— that would have added a blockchain-powered payments feature to Facebook, Inc’s apps. But it didn’t happen after key supporters folded following pressure on Facebook from global regulatory agencies to halt the project.\nRegardless, the Facebook CEO is a big fan of cryptocurrencies like Bitcoin. He may even be a Bitcoin maximalist (someone who believes Bitcoin will be the largest global reserve currency in the future).\nHis goats are named Bitcoin and Max.\nMicrosoft founder Bill Gates said in 2022 that he’s not bullish on Bitcoin. “If you have less money than Elon, watch out,” he said. However, Gates is also known for his frugality and responsible, calculated risk-taking in the high-tech business.\n“Elon has tons of money, and he’s very sophisticated, so I don’t worry that his Bitcoin will randomly go up or down,” Gates said right before markets crashed and burned in 2022. “I do think people get brought into these manias who may not have as much money to spare, so I’m not bullish on Bitcoin.”\nHowever, he did once say that, “Bitcoin is a technological tour de force,” so he respects the innovative way Bitcoin put different Internet techniques together to create digital scarcity in a realm where making copies of digital items is almost free.\n“Any time there is innovation, I find it exciting,” Pichai said in response to a question about the technology on an Alphabet earnings call in 2022. “I think it’s something we want to support the best we can.”\n“We are definitely looking at blockchain,” the Alphabet CEO said later that year. “It’s such an interesting powerful technology with broad applications.”\nMusk has been a big supporter of blockchain for years.\nIn 2021, he said, “It [cryptocurrency] bypasses currency controls… Paper money is going away. And crypto is a far better way to transfer values than a piece of paper, that’s for sure.”\nMusk has long been a big fan of cryptocurrencies, especially Dogecoin. He has styled himself, “The Doge Father” and frequently tweets and speaks fondly of Dogecoin. His most recent mention coincided with a 14% spike in Dogecoin price and market capitalization.\n",
    "referenceLinks": [
      "https://cryptopotato.com/heres-why-jack-dorseys-block-will-invest-10-of-bitcoin-profits-into-btc-monthly/",
      "https://www.cnbc.com/2021/10/21/peter-thiel-on-bitcoin-i-feel-like-ive-been-underinvested-in-it.html",
      "https://fortune.com/crypto/2023/01/18/peter-thiels-founders-fund-sold-crypto-just-before-markets-soured/",
      "https://cryptopotato.com/peter-thiels-fund-back-into-bitcoin-and-ether-sparking-silicon-valleys-crypto-interest-report/",
      "https://cryptopotato.com/libra-vs-bitcoin-what-is-facebooks-libra-coin-why-is-it-different-from-bitcoin/",
      "https://mashable.com/article/mark-zuckerberg-goat-bitcoin-max",
      "https://www.cnbc.com/2022/03/09/bill-gates-on-bitcoin-if-you-have-less-money-than-elon-watch-out.html",
      "https://www.foxbusiness.com/video/2359385547001#sp\u003dshow-clips",
      "https://www.cnbc.com/2021/07/22/elon-musk-says-he-plans-to-hold-bitcoin-long-term-on-the-b-word-panel.html",
      "https://cryptopotato.com/dogecoin-spikes-14-on-latest-elon-musk-endorsement/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/Screenshot-2024-05-12-at-8.42.56-3kbzrglnkeuvjou4z879je.png"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Crypto Is A Major Election Issue For 20% Of Voters: DCG Survey",
    "category": "DCG, US Congress",
    "author": "Andrew Throuvalas",
    "link": "https://cryptopotato.com/crypto-is-a-major-election-issue-for-20-of-voters-dcg-survey/",
    "creationDate": "May 12, 2024",
    "content": "Crypto is emerging as a hot topic in the U.S. presidential election this year, with many voters looking forward to hearing their candidates takes on the asset class.\n",
    "referenceLinks": [],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/biden_trump_cover-3c42xlnzavyn5k93187ea2.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Bitcoin Unable to Recover Decisively, Ethereum Consolidates Below $3K (Weekend Watch)",
    "category": "Bitcoin (BTC) Price",
    "author": "George Georgiev",
    "link": "https://cryptopotato.com/bitcoin-unable-to-recover-decisively-ethereum-consolidates-below-3k-weekend-watch/",
    "creationDate": "May 12, 2024",
    "content": "The cryptocurrency market has calmed down considerably in the past 24 hours, halting the bearish assault and finding some consolidation in the process.\nBitcoin’s price is trading at around $61K on Sunday morning, while Ethereum is now firmly below the pivotal $3K level.\nAs CryptoPotato reported yesterday, Bitcoin’s price experienced a sudden correction, dropping below $61K and losing around 3.5% in a single day.\nThis seemingly had to do with a statement from a representative of the US Federal Reserve, who said that it may be too early to think about rate cuts.\nThe market has calmed down since then, and it seems that the worst is behind us.\nDid you like this market update? This is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day:\nThe bulls even attempted a recovery, but it was quickly halted at around $61.4K when sellers stepped in and pushed the price to $61K, where it currently trades.\nIt’s worth noting that despite the recent declines, the Fear and Greed index is still pointing out that the market is in a state of “greed.”\nNone of the major altcoins by means of total market capitalization has recovered from the crash the other day, but at least they are consolidating and charting ever so slight gains, as seen in the heatmap below.\nEven though the market seems to be completely painted in green, that’s just the 24-hour heatmap. On a seven-day scale, most of the cryptocurrencies are trading in the red.\nIt’s worth noting that Ethereum is now consolidating below the critical psychological level of $3K, and it’s very interesting to see if the buyers will be able to reclaim it soon.\nMeanwhile, today’s best performers are Immutable (IMX) – up 4.7%, and Ribbon Finance (RBN) – up 3.3%.\nOn the other hand, the cryptocurrencies that performed the worst are Zebec Protocol (ZBC) – down 7.8%, and Kaspa (KAS) – down 4.8%.\n",
    "referenceLinks": [
      "https://cryptopotato.com/bitcoin-crashes-below-61k-as-altcoins-take-massive-beating-weekend-watch/",
      "https://alternative.me/crypto/fear-and-greed-index/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Bitcoin Miner Marathon Digital Misses Revenue Expectations Due to Production Setbacks",
    "category": "Bitcoin Mining, Marathon Digital",
    "author": "Wayne Jones",
    "link": "https://cryptopotato.com/bitcoin-miner-marathon-digital-misses-revenue-expectations-due-to-production-setbacks/",
    "creationDate": "May 11, 2024",
    "content": "Marathon Digital, a Bitcoin mining company, fell short of revenue expectations set by Wall Street analysts in the first quarter 2024 report.\nThe firm cited adverse weather conditions and equipment malfunctions as contributing factors to the lower-than-expected performance.\nDespite a year-on-year revenue growth of 223% to $165.2 million, as disclosed on May 9, the company’s performance still trailed the projected estimate of $193.9 million by 14.80%, according to investment analyst firm Zacks.\nDuring the first quarter of 2024, Marathon Digital reported mining 2,811 BTC, valued at $176.7 million, marking a 28% increase compared to the previous year. However, this is a 34% decline from the 4,242 BTC mined in Q4 2023.\nMarathon CEO Fred Thiel addressed the company’s performance on a May 9 earnings call. He said the production setbacks were due to unexpected equipment failures, particularly transformers on third-party hosted sites, high weather-related disruptions in many locations, and utility company transmission line maintenance.\nThe firm noted that adverse weather conditions impacted its Garden City site in central Texas and other venues, including a newly acquired Texas location as of April 2. Despite these challenges, the company operated at a “record high” of 27 exahashes per second. Thiel highlighted the company’s goal of reaching 50 EH/s by year-end, which was revised upward from a target of 35 to 37 EH/s in late April.\nThiel noted that Marathon was able to adapt and overcome operational challenges in the first quarter. The firm redistributed equipment to newly acquired sites while ongoing repairs were underway.\nMarathon also introduced several new advanced products during the quarter, including Slipstream, aimed at improving Bitcoin transaction speed, and the MARA UBC 2100 control board, designed to enhance mining efficiency. Through strategic acquisitions, Marathon has expanded its mining capacity to 1.1 and currently operates at 54% of its total capacity.\nMarathon Digital reported first-quarter earnings per share of $1.26, which initially seemed significantly higher than Wall Street’s projected $0.02. However, these figures aren’t directly comparable because the company has adopted the newly-approved FASB fair value accounting rules. The mark-to-market adjustment was favorable, influenced by the substantial increase in Bitcoin prices.\nAfter the May 9 report, Marathon Digital (MARA) shares dropped about 2.19% to close at $19.65, with an extra 1% decrease in after-hours trading per Google Finance. Year-to-date, the company’s share price has fallen by 14.30% since peaking at $31.03 on February 28, 2024.\n",
    "referenceLinks": [
      "https://ir.mara.com/news-events/press-releases/detail/1357/marathon-digital-holdings-reports-first-quarter-2024-results",
      "https://cryptopotato.com/marathons-2023-bitcoin-production-surpasses-563-million-tripling-2022-output-report/",
      "https://cryptopotato.com/marathon-digital-reports-revenue-increases-of-452/",
      "https://www.google.com/finance/quote/MARA:NASDAQ"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/Marathon-3jia0icnnicpnqw789la8a.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "We Asked ChatGPT if Bitcoin Will Enter a Massive Bull Run in 2024",
    "category": "Bitcoin, Bitcoin (BTC) Price, ChatGPT",
    "author": "Dimitar Dzhondzhorov",
    "link": "https://cryptopotato.com/we-asked-chatgpt-if-bitcoin-will-enter-a-massive-bull-run-in-2024/",
    "creationDate": "May 11, 2024",
    "content": "TL;DR\nBitcoin (BTC) started 2024 on the right foot, seeing its price gradually rising in the first quarter and even hitting a new all-time high of over $73,500 in mid-March. However, the past two months have not been that successful, with the asset briefly plunging below the $60K mark and currently trading at around $63,000 (per CoinGecko’s data).\nAs such, we decided to ask ChatGPT whether a new bull run is on the horizon this year. The AI-powered chatbot claimed that predicting Bitcoin’s price behavior is quite speculative and depends on several factors.\nIt assumed that a new bull run may be triggered by technological developments, increased adoption, positive investor sentiment, public interest, geopolitical events, and whatnot.\nBesides the aforementioned factors, ChatGPT touched upon two particular elements that could trigger a BTC price resurgence: actions coming from the US Federal Reserve and the outcome of the lawsuit between Ripple and the US SEC.\nShortly after the COVID-19 pandemic, America’s central bank launched an aggressive anti-inflationary policy to decrease the inflation rate in the world’s largest economy. It introduced multiple rate hikes, which might have halted investments in riskier assets such as cryptocurrencies.\nHowever, there are some indications that the Fed may pivot from that regime later this year, a move that many BTC bulls hope for.\n“Lowering interest rates can stimulate the flow of money into Bitcoin by altering investor behavior, adjusting risk appetites. These factors combined can contribute to upward movements in Bitcoin’s price,” ChatGPT estimated.\nFurthermore, a decisive triumph for Ripple in its legal case against the SEC may fuel an overall revival for the cryptocurrency market. The companies entered into a trial phase last month, and according to some, Ripple has a better chance to emerge victorious due to the three partial court wins secured throughout 2023.\n“A win for Ripple might be seen as a defeat for potential overreach by regulatory bodies like the SEC, boosting investor confidence in the resilience of major cryptocurrencies against regulatory challenges. This could encourage both retail and institutional investors to increase their stakes in cryptocurrencies, including Bitcoin,” the chatbot concluded.\n\n\n\n\n\n",
    "referenceLinks": [],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/BTC-CHATGPT_BULL_CB-1-3kblqai32qsla6gx4a69l6.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Former Digitex Futures Exchange CEO Pleads Guilty to Violating Bank Secrecy Act",
    "category": "Digitex, Legal",
    "author": "Wayne Jones",
    "link": "https://cryptopotato.com/former-digitex-futures-exchange-ceo-pleads-guilty-to-violating-bank-secrecy-act/",
    "creationDate": "May 11, 2024",
    "content": "Founder and former CEO of Digitex Futures Exchange, Adam Todd, has pleaded guilty to willingly leading the firm to fail to establish an Anti-Money Laundering (AML) program.\nNotably, the former CEO’s plea was issued in a federal court in the Southern District of Florida on May 7.\nThe U.S. Attorney’s Office stated that Todd pleaded guilty to “willfully causing” Digitex to violate the Bank Secrecy Act. Indicted earlier this year, Todd was accused of overseeing an unregistered futures platform targeting U.S. customers from 2018 to 2022, allegedly neglecting vital Anti-Money Laundering (AML) and Know Your Customer (KYC) protocols.\nIn 2020, Todd announced that there would be “no KYC identity verification requirements of any kind” following a data breach at Digitex. It was reported that a former exchange employee stole information from user’s passports and driver’s licenses.\nAt the time, Digitex claimed to be blocking U.S. IPs and requested users to confirm that they were not based in the United States. The U.S. Commodity Futures Trading Commission (CFTC) then filed a lawsuit against Todd and Digitex in 2022. The following year, they won their case, resulting in an order for $16 million in disgorgement and penalties.\nAccording to Todd’s LinkedIn profile, he resigned as Digitex CEO in October 2022 and has been the lead developer at Digitex Games since February 2023.\nTodd is facing up to five years in prison and a $250,000 fine for his actions. However, the U.S. Attorney’s Office has not yet announced Todd’s sentencing hearing date.\nDigitex’s legal challenges add to the ongoing series of legal issues surrounding exchanges in the crypto industry, which also includes FTX and Binance.\nIn 2022, Sam Bankman-Fried, the former CEO of FTX, was arrested and extradited to the United States. Initially entering a plea of not guilty, he was placed under house arrest but subsequently remanded to jail due to allegations of witness intimidation. After a six-week trial, he was convicted and sentenced to 25 years in prison.\nConversely, Changpeng Zhao, the CEO of Binance, faced charges in 2023. He pleaded guilty and was granted bail, allowing him to remain free. Last month, he was sentenced to four months in prison.\nBankman-Fried faced seven felony charges related to defrauding investors and misusing customer funds. In contrast, Zhao faced one charge related to failing to maintain an effective Anti-Money Laundering program at Binance.\n",
    "referenceLinks": [
      "https://www.justice.gov/usao-sdfl/pr/cryptocurrency-futures-market-ceo-pleads-guilty-violating-bank-secrecy-act",
      "https://cryptopotato.com/us-government-charges-digitex-futures-exchange-ceo-with-bank-secrecy-act-violation/",
      "https://cryptopotato.com/adam-todd-digitex-futures-ceo-i-really-want-to-take-bitmex-down/",
      "https://cryptopotato.com/former-ftx-chief-sam-bankman-fried-sentenced-to-25-years-in-prison/",
      "https://cryptopotato.com/ex-binance-ceo-changpeng-zhao-receives-4-months-jail-time-for-aml-violations/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/Court-3iqcnxr4372iboy7alglxm.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Mark Cuban Joins Calls Against Anti-Crypto Biden Administration, Slams the SEC",
    "category": "Joe Biden, Mark Cuban, Regulations, SEC",
    "author": "Martin Young",
    "link": "https://cryptopotato.com/mark-cuban-joins-calls-against-anti-crypto-biden-administration-slams-the-sec/",
    "creationDate": "May 11, 2024",
    "content": "On May 11, the American businessman and television personality said if Joe Biden loses the presidential election, “there is a good chance you will be able to thank Gary Gensler and the SEC (Securities and Exchange Commission).”\n“Crypto is a mainstay with younger and independent voters,” he said before adding that SEC Chair Gensler “has not protected a single investor against fraud.”\nThe outspoken entrepreneur didn’t stop there, adding that all the SEC has done is make it virtually impossible for crypto companies to operate in the United States, “killing who knows how many businesses and ruining who knows how many entrepreneurs.”\nIf @joebiden loses, there is a good chance you will be able to thank @GaryGensler and the @NewYork_SEC Crypto is a mainstay with younger and independent voters. Gensler HAS NOT PROTECTED A SINGLE INVESTOR AGAINST FRAUD\nAll he has done is make it nearly impossible for… https://t.co/uBKupxLhS9\n— Mark Cuban (@mcuban) May 10, 2024\n\nThe comments came in response to a May 10 Politico article reporting that Donald Trump has become the first major party presidential nominee to overtly court the crypto community.\nTrump told supporters this week that they should vote for him because of the way the Biden administration has cracked down on the crypto industry.\nKristin Smith, CEO of the Blockchain Association, said, “President Trump’s remarks signal a sea change in the importance of digital assets this election cycle,”\nCuban, who castigated the SEC in 2023, continued with a warning to Congress stating that crypto voters will be heard this election. He suggested that passing legislation specifically for crypto companies and the asset class could solve the problem for Biden before adding:\n“Or you could do the better option and assign all crypto to be regulated by the CFTC (Commodity Futures Trading Commission).”\nBitcoin environmentalist Daniel Batten agreed with Cuban, commenting:\n“Joe Biden could well be the world’s first politician to lose an election due to his party’s open hostility towards Bitcoin, and indulgence of colleagues spreading misinformation about Bitcoin.”\nCuban wasn’t the only one lashing out at the Biden administration this week. Cardano founder Charles Hoskinson lambasted the White House in a video on X on May 9.\n“A vote for Biden is a vote against the American cryptocurrency industry,” said Hoskinson, who added that the Biden administration is actively trying to “destroy the American cryptocurrency industry.”\nOthers, including Ethereum advocate Ryan Sean Adams and Stock-to-flow model creator “PlanB”, joined the calls against the anti-crypto administration.\nBiden hates crypto Biden hates the unvaccinated\n– 40% of US adults hold crypto – 20% unvaccinated in the US\nIF Trump embraces crypto AND restores basic human rights (informed consent, bodily integrity, freedom of speech) THEN he gets 50% of votes AND wins the Nov’24 elections! pic.twitter.com/sC7BvYOn1y\n— PlanB (@100trillionUSD) May 9, 2024\n\nBiden’s war on crypto has escalated in recent weeks. The SEC is now targeting larger trading companies, such as Robinhood, which received a threat of enforcement action over its crypto business this month.\nAdditionally, Biden’s office said it would veto legislation seeking to overturn SEC guidelines that discourage banks from holding crypto assets in custody.\nPro-crypto Senator Cynthia Lummis reacted to Biden’s threat to ban banks from holding crypto for their customers, stating, “We will not allow the administration to regulate tools for financial freedom out of existence.”\n",
    "referenceLinks": [
      "https://twitter.com/JoeBiden?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/GaryGensler?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/NewYork_SEC?ref_src\u003dtwsrc%5Etfw",
      "https://t.co/uBKupxLhS9",
      "https://twitter.com/mcuban/status/1789037772050702824?ref_src\u003dtwsrc%5Etfw",
      "https://www.politico.com/news/2024/05/10/trump-crypto-biden-00157051",
      "https://cryptopotato.com/donald-trump-takes-new-approach-toward-crypto-bashes-bidens-hostile-administration/",
      "https://cryptopotato.com/mark-cuban-says-the-sec-approach-to-crypto-led-to-billions-in-losses/",
      "https://twitter.com/DSBatten/status/1789065730903638456",
      "https://twitter.com/IOHK_Charles/status/1788294144181543383",
      "https://twitter.com/RyanSAdams/status/1789000153124196672",
      "https://t.co/sC7BvYOn1y",
      "https://twitter.com/100trillionUSD/status/1788597142052835577?ref_src\u003dtwsrc%5Etfw",
      "https://cryptopotato.com/sec-slaps-robinhood-with-wells-notice-over-securities-law-violations/",
      "https://cryptopotato.com/biden-admin-to-kill-republican-bill-letting-u-s-banks-custody-crypto/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/MarkCuban-3e93sb26b3m891lq6y4lje.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Calm Before the Storm? DOT Eyes This Level to Trigger Mass Liquidations (Polkadot Price Analysis)",
    "category": "Polkadot (DOT) Price",
    "author": "CryptoVizArt",
    "link": "https://cryptopotato.com/calm-before-the-storm-dot-eyes-this-level-to-trigger-mass-liquidations-polkadot-price-analysis/",
    "creationDate": "May 11, 2024",
    "content": "Polkadot’s recent price action has been characterized by steady but uncertain movements within a defined range, highlighting a balance between buyers and sellers.\nHowever, a decisive breakout from this range is imperative to determine its future trajectory.\nBy Shayan\nOn the daily chart, Polkadot has been trapped within a defined range, with the $6 support and the $7.5 resistance serving as significant boundaries. This sideways movement indicates a period of consolidation, during which buyers and sellers are evenly matched, leading to uncertainty about the cryptocurrency’s next move.\nAlthough there was a bullish rebound towards the upper boundary of the range, which coincided with the 200-day moving average, selling pressure emerged, resulting in a rejection.\nThis suggests that the price is likely to continue declining towards the lower boundary of the range in the short term. Nevertheless, a breakout from this range is needed to provide clarity on Polkadot’s future prospects.\nExamining the 4-hour timeframe, Polkadot has formed an ascending wedge pattern following a period of sideways consolidation between the key $6 support level and the significant resistance marked by the 0.5 Fibonacci level at $7.5.\nThis development has raised concerns about the continuation of the preceding bearish trend if the lower threshold of the wedge is breached.\nAs a result, intensified selling pressure has been observed near the crucial resistance level of $7.5, leading to a bearish reversal, with the lower trendline of the wedge serving as the next target. Should sellers succeed in breaking this critical dynamic support, a resumption of the initial bearish trend becomes increasingly likely. Conversely, if demand strengthens, continued sideways consolidation appears to be the most probable scenario.\nBy Shayan\nUnderstanding the perpetual futures market dynamics is crucial for grasping short-term price movements in cryptocurrencies like DOT. Liquidation events in this market often drive significant price shifts, particularly after periods of consolidation. Visualizing potential liquidity zones can offer valuable insights into where these events might occur.\nThe provided Binance DOT/USDT heatmap illustrates levels where large-scale liquidations could transpire. The likelihood of a liquidation cascade increases when the price approaches areas marked in yellow. Currently, a notable liquidity pool is observed above the $7.5 level. If the price reaches this region, it could trigger a significant liquidation event, leading to a rapid downturn.\nAs a result, following the ongoing consolidation phase, the price might experience a short-term pullback toward this level. However, for longer-term projections, it’s essential to analyze how the price reacts to this zone carefully. Market dynamics can shift rapidly, and nothing is guaranteed at this juncture.\n",
    "referenceLinks": [
      "https://www.linkedin.com/in/shayan-navabi-522107248/",
      "https://www.linkedin.com/in/shayan-navabi-522107248/"
    ],
    "pictureLink": "https://cryptopotato.com/wp-content/uploads/thumbs/DOT-D-2-scaled-3kbtlzwj7eeahhs0y568zu.jpg"
  }
]
