[
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Brace Yourself: Analysts See Ethereum Dipping to $2500 Soon!",
    "category": "ETh, Ethereum",
    "author": "Syofri",
    "link": "https://www.ethnews.com/brace-yourself-analysts-see-ethereum-dipping-to-2500-soon/",
    "creationDate": "May 11, 2024",
    "content": "Ethereum (ETH) is at the forefront of the major fall now affecting the cryptocurrency market. At $2,906.11, ETH has been down 3.98% in the past 24 hours, bringing its weekly loss to 7.55%, according to CoinMarketCap. This bearish trend raises concerns about its future prospects and short-term stability.\nThe second-biggest cryptocurrency by market cap, ETH, is struggling with weaker fundamentals in addition to market volatility.\nEthereum’s uneven performance in current market cycle, in sharp contrast to its typical function as a trigger for positive trends, has analysts at 10X Research raising concerns about the possibility of a low of $2,500.\nA recent study with an astounding R-square of 95% demonstrated the strong correlation between ETH and Bitcoin.\nThis implies that the decline of ETH may have an immediate effect on the performance of BTC, therefore impeding the capacity of the larger cryptocurrency market to draw in fiat money.\nSector Professionals Weigh Notably, Ethereum is underperforming technically and fundamentally, according to Daniel Yan of Kryptanium Capital.\n\nHe issues a caution that Ethereum may swiftly drop into the $2,500–$2,600 zone if the price falls below $2,950, which would exacerbate the problems facing the market.\nWith a move toward Ethereum Layer 2 solutions, which last month accounted for an amazing 82% of all Ethereum transactions, the mainnet of Ethereum is witnessing less activity. This change in usage of Ethereum’s network is mostly the result of reduced transaction costs.\nNot insignificant changes are also taking place in the ETF scene. The staking component was eliminated from ARK Invest and 21Shares’ spot ETH ETF application lately, in line with what ETHNews previously disclosed.\nPerhaps in response to possible comments from the Securities and Exchange Commission (SEC), this streamlining aims to expedite the clearance process.\n",
    "referenceLinks": [
      "https://www.ethnews.com/ethereum-etf-hopes-dim-after-sec-meetings-eos-competitor-borroe-finance-gears-up-for-growth/",
      "https://mail.10xresearch.co/p/whats-going-ethereum-even-care",
      "https://www.ethnews.com/bitcoin-drops-below-61000-taking-altcoins-sinking-with-it/",
      "https://twitter.com/_D_Y_A_N/status/1788834542260039842",
      "https://t.co/ja7bYHTq3i",
      "https://twitter.com/_D_Y_A_N/status/1788834542260039842?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/ethereum-network-faces-inflation-post-dencun-analyzing-the-effects-on-ultra-sound-money/",
      "https://www.ethnews.com/ark-21shares-modify-spot-ethereum-etf-proposal-sec-decision-expected-in-may-2024/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/04/unnamed-2024-04-15T094142.616-696x392.jpg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Biden’s Crypto Crackdown? Uniswap’s Hayden Adams Talks Toughly About the Future of Finance",
    "category": "biden, crypto, Uniswap",
    "author": "Syofri",
    "link": "https://www.ethnews.com/bidens-crypto-crackdown-uniswaps-hayden-adams-talks-toughly-about-the-future-of-finance/",
    "creationDate": "May 11, 2024",
    "content": "Uniswap founder Hayden Adams highlighted the impressive degree of adult cryptocurrency acceptance, demonstrating its growing presence in traditional financial systems. This is a big turning point since digital currencies are moving from being a niche to a regular part of many individuals’ financial plans.\nCryptocurrency growth is putting a lot of strain on conventional banking institutions. The conventional banking industry is being forced into a revolutionary change as more people and investors look to digital assets as respectable investment options.\nThis tendency questions the current state of asset management and financial transactions by highlighting the increasing impact and integration of cryptocurrencies within the larger financial environment.\nDespite the fact that authorities all over the world are closely monitoring the cryptocurrency industry, Adams is still optimistic about its future.\nThis assurance follows the declaration by President Joe Biden that he will veto laws that would relax rules governing financial institutions that hold Bitcoin and other cryptocurrencies, in line with what ETHNews previously disclosed.\nAdams contends that such governmental actions would eventually fail in their attempts to slow down the rise of virtual currencies.\nAdams urges for a well-rounded regulatory structure that encourages creativity while reducing possible hazards. As the cryptocurrency market grows, it is becoming more and more evident that clear rules are needed.\nGiving investors and companies more assurance would enable them to more successfully negotiate this changing environment and guarantee that innovation and growth coexist peacefully with consumer protection and stable markets.\nAs is common in the cryptocurrency world, Adams sees regulatory obstacles as growth stimulants that will enable the market to mature and innovate even more. This upbeat viewpoint confirms the idea that virtual currencies have revolutionary potential for international finance.\n",
    "referenceLinks": [
      "https://www.ethnews.com/banking-consortium-r3-leads-9m-round-in-encrypted-layer-2-on-ethereum/",
      "https://www.ethnews.com/bidens-veto-of-bitcoin-legislation-implications-for-cryptocurrency-regulations/",
      "https://www.ethnews.com/multibank-io-unveils-gamified-mission-center-rewarding-cryptocurrency-trading/",
      "https://www.ethnews.com/uniswap-ceo-hayden-adams-on-ethical-token-distribution-transparent-fair-practices/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/Biden-696x392.webp"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Tron’s Simply Cryptos and JustLend DAO Lead in TVL Growth",
    "category": "",
    "author": "Isai Alexei",
    "link": "https://www.ethnews.com/trons-simply-cryptos-and-justlend-dao-lead-in-tvl-growth/",
    "creationDate": "May 11, 2024",
    "content": "Tron’s DeFi ecosystem now has a total value locked (TVL) of $21.7 billion. Simply Cryptos and JustLend DAO lead the growth, indicating an active and engaged user base. The TVL, which measures the amount of digital currency staked within the DeFi platform, shows robust liquidity and activity in Tron’s smart contracts.\n\nTRX, the native token of Tron, currently faces a short-term decline in value. Simply Cryptos holds a TVL of $7.1 billion, while JustLend DAO has $6.4 billion. The recent TVL increase reflects a positive growth trend for these platforms.\nAnalyzing Tron’s trading volume and price reveals recent gains in both. Over the last three weeks, TRX’s value has risen from $0.107 to $0.127, indicating that buyers are purchasing the token at lower prices. This rise in trading volume points to potential long-term growth.\n\nCurrently, TRX trades at $0.12731546, with a slight 0.27% daily drop. Despite this, the market trends suggest an optimistic outlook.\n\nThe token has a monthly return of 7.35% and an annual return of 18%, with a market cap of $11.14 billion. Analysts remain optimistic, predicting future price growth.\n\nSupport levels for TRX are $0.12055349 and $0.11311939, potential points for stabilization or a rebound. Resistance levels are $0.14076094 and $0.13382581, where price consolidation or reversal might occur. If the upward trend continues, TRX could reach the $0.200 mark.\n\nThis analysis provides a clear picture of Tron’s growth in DeFi and outlines the current challenges and future opportunities within the trading market.\n\n\nThe current price of TRON (TRX) is approximately $0.1263 USD. Based on technical analysis and market trends, it is noted that TRON has shown a slight increase in price recently. However, volatility remains a considerable factor.\nI anticipate that the price of TRX could experience moderate fluctuations in the short term, but is expected to remain in a range between $0.12 and $0.14 USD in the coming weeks.\n",
    "referenceLinks": [
      "https://www.ethnews.com/tron-trx-market-update-assessing-the-aftermath-of-a-20-pullback/",
      "https://www.ethnews.com/tron-network-data-integrated-with-token-terminal-unveiling-new-insights-for-analysts/",
      "https://www.ethnews.com/tron-leverages-aws-full-node-deployment-on-cloud-giants-platform/",
      "https://www.ethnews.com/tron-vs-sec-legal-showdown-escalates-as-trx-challenges-jurisdiction-impact-on-investors/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2023/03/Stanslavs-TRON-3-696x464.jpg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Splash $5.56 Million: Crypto Whales Go Big on PEPE Coin!”",
    "category": "Pepe, Pepe Coin, whale",
    "author": "Syofri",
    "link": "https://www.ethnews.com/splash-5-56-million-crypto-whales-go-big-on-pepe-coin/",
    "creationDate": "May 11, 2024",
    "content": "Major cryptocurrency whales are taking advantage of the present slump to amass significant amounts of the meme coin Pepe (PEPE), with a total transaction value of almost $5.56 million, in an amazing example of market strategy.\nThis deliberate building up has occurred at the same time when the cryptocurrency markets have been generally declining, suggesting that seasoned investors may be taking a contrarian approach to investing.\nAccording to on-chain analysis Spot On Chain, one notable crypto whale with the wallet address 0xa14 has been active in the PEPE market. This investor took out a whooping 350.2 billion PEPE, or $2.92 million, from the cryptocurrency exchange Binance.\n\nThis deal is the investor’s fourth large one in a string, and the expected profit from these operations comes to $1.63 million, a respectable 15% rise.\nThis whale has been withdrawing 1.449 trillion PEPE from Binance at an average price of $0.000007496, with a total expenditure estimated at $10.86 million, continuously since March 14, 2024.\nThe whale resumed the transactions by returning to Binance a total of 789.26 billion PEPE, which he had purchased for an average of $0.000008542, or $6.74 million. At present, this investor has 660 billion PEPE, or about $5.74 million.\nIn the past three trading cycles, this investor has profited cumulatively $955,000 with PEPE, achieving a 100% success record.\nWith purchases like those of wallet address 0xa4F, who purchased 123.66 billion PEPE for $0.00000881, equivalent to $1.09 million in USDC, and wallet address 0x895, who withdrew 101 billion PEPE worth around $885,000 from Binance, other notable traders have also followed this pattern.\nIn the middle of these large transactions, PEPE has demonstrated resilience in a choppy market.\nEven with a general bearish trend over the previous seven days—a 3.52% decline and a 2.51% drop in the most recent 24 hours to a current price of $0.000008488—PEPE has demonstrated a great comeback potential.\nIn light of the significant decline in Bitcoin itself last week—nearly 5% from $63,400 to $60,180—this resiliency is quite remarkable.\nAccording to market analysts, PEPE may rise up to $0.00001330, or 51% more than its current price, based on the existing chart patterns.\nInvestors are cautioned to monitor important resistance levels at $0.00000890, as a daily close below $0.00000785 could nullify this bullish forecast and indicate potential falls.\nBeside that, as previously reported by ETHNews, Pepe Coin has also been emphasized as a well-liked memecoin on the Ethereum network because of its much larger transaction volume than rivals, which has cemented its market share.\n",
    "referenceLinks": [
      "https://www.ethnews.com/pepes-rollercoaster-expert-breakdown-on-why-its-the-crypto-to-watch/",
      "https://twitter.com/spotonchain/status/1789139219576672278",
      "https://twitter.com/search?q\u003d%24PEPE\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/search?q\u003d%24PEPE\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/search?q\u003d%24PEPE\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://t.co/9MTBk1nUxj",
      "https://twitter.com/spotonchain/status/1789139219576672278?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/india-says-yes-binance-and-kucoin-make-a-comeback/",
      "https://www.ethnews.com/pepes-35-surge-will-the-momentum-last-through-april-insights/",
      "https://www.ethnews.com/pepes-rally-rocks-crypto-why-this-memecoin-is-still-the-king-of-ethereum/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/04/PEPE-coin-crypto-meme-696x392.jpg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Ethernity’s Big Move: Layer-2 Upgrade Boosts NFT Game and ERN’s Market Surge",
    "category": "ern, Ethereum, Ethernity, layer-2",
    "author": "Syofri",
    "link": "https://www.ethnews.com/ethernitys-big-move-layer-2-upgrade-boosts-nft-game-and-erns-market-surge/",
    "creationDate": "May 11, 2024",
    "content": "Ethernity has introduced a Layer-2 solution to the Ethereum blockchain. This move attempts to solve the adoption issues big businesses are having with blockchain technology.\nIn addition, Ethernity is a top platform for licensed and legitimate NFTs with players like Shaquille O’Neal, Muhammad Ali, and Lionel Messi.\n\nBy improving privacy, cutting transaction costs, and streamlining user interfaces, the new Ethernity Chain Layer-2 technology claims to completely transform the user experience.\nThe platform uses artificial intelligence (AI) to power enhanced security mechanisms that apply Digital Rights Management (DRM) in an effort to stop counterfeit trafficking and safeguard the intellectual property of creators.\nCo-Chief Executive Officer of Ethernity, Nick Rose Ntertsas, stressed that moving to Layer-2 would greatly improve the way entertainment brands communicate with their audiences via Web3 technology.\nThe update guarantees sustainability in developing innovative entertainment experiences and goods, in addition to providing developers with a safe and easily navigated environment.\nEthernity is getting ready to introduce a number of cutting-edge initiatives on this enhanced infrastructure in the near future.\nThese include 0xLoans, a peer-to-peer lending protocol that uses NFTs as collateral; Fanable App, a mobile platform marketplace for real-world asset collections; and Exorians, a new sci-fi series and Web3 game, expanding on what was earlier reported by ETHNews.\nAlso, according to CoinMarketCap, the native token of Ethernity, ERN, is currently trading at about $5.27, up 10.21% over the last 24 hours and a noteworthy 45.74% over the last week. But, it is still far behind its all-time high (ATH) of $74.13, and the current market cap has also increased to over $108.4 million.\n",
    "referenceLinks": [
      "https://twitter.com/EthernityChain/status/1787846808187875595",
      "https://twitter.com/search?q\u003d%24ERN\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://t.co/ezlWYQVUCA",
      "https://twitter.com/EthernityChain/status/1787846808187875595?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/breaking-boundaries-tron-creator-introduces-bitcoin-layer-2-as-btc-defi-skyrockets/",
      "https://www.ethnews.com/spectral-labs-joins-hugging-faces-esp-program-to-advance-the-onchain-x-open-source-ai-community/",
      "https://www.ethnews.com/sui-turns-one-debut-year-of-growth-and-tech-breakthroughs-puts-sui-at-forefront-of-web3/",
      "https://www.ethnews.com/animoca-hits-the-bitcoin-scene-game-changing-moves-for-web3-gaming/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/Ethernity-696x392.jpg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Bitcoin Drops Below $61,000, Taking Altcoins Sinking With It",
    "category": "Altcoin, Bitcoin, BTC",
    "author": "Syofri",
    "link": "https://www.ethnews.com/bitcoin-drops-below-61000-taking-altcoins-sinking-with-it/",
    "creationDate": "May 11, 2024",
    "content": "The cryptocurrency market has suffered greatly in the last day, with Bitcoin spearheading a broad decline in most other digital currencies. At first steady around $63,000 for the entire week, Bitcoin’s price abruptly fell below $61,000, a significant decline for the top cryptocurrency.\nAccording to CoinMarketCap, Bitcoin’s current price is about $60,712.09, down 4.09% in the last 24 hours. It has also had a bearish position of 5.10% during the last 7 days.\nThe President of the Dallas Federal Reserve, Lorie Logan, made remarks during a conference in New Orleans that appeared to have set off this precipitous fall in the value of Bitcoin.\nLogan made a suggestion that talking about rate reductions would be premature, which infuriated investors and caused a sell-off that turned the charts crimson. The subsequent liquidation of almost $200 million in positions highlighted the market’s volatility and unease.\nNot only Bitcoin suffered significant losses, but most other cryptocurrencies did as well. Each of Ethereum, Solana, and Polkadot fell by 4.1% to about 6%, and the market heatmap turned red.\nParticularly badly hit were ThorChain and Theta Network, which fell by 9.2% and 10.8%, respectively.\nBy contrast, a few cryptocurrencies, such as Cheelee and Akash Network, were able to defy the general market chaos. Investors were given some hope amid an otherwise depressing market period by the roughly 3% advances in both digital assets.\nBut one has to take into account the background of these market swings. Before this sharp fall, Bitcoin whales were very active, having bought almost $941 million worth of the cryptocurrency, as previously reported by ETHNews.\nMajor players’ large investment was mostly seen as a favorable indication for Bitcoin’s long-term prospects, implying that, for those with a wider perspective, current prices could offer a purchasing chance.\n",
    "referenceLinks": [
      "https://www.ethnews.com/bitcoins-price-correction-funding-rate-suggests-bearish-sentiment-persists/",
      "https://www.ethnews.com/federal-reserve-decision-looms-over-bitcoin-what-traders-should-know/",
      "https://www.ethnews.com/ethereum-vs-solana-yakovenko-highlights-technical-differences/",
      "https://www.ethnews.com/bitcoin-whales-splash-941m-whats-next-for-btc/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/Bitcoin-696x456.webp"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Jam Out with Duet Monsters: Sky Mavis’s Latest Mobile Game Unleashes Musical Battles and Crypto Rewards",
    "category": "Duet Monsters, game, sky mavis",
    "author": "Syofri",
    "link": "https://www.ethnews.com/jam-out-with-duet-monsters-sky-maviss-latest-mobile-game-unleashes-musical-battles-and-crypto-rewards/",
    "creationDate": "May 11, 2024",
    "content": "Renowned for their smash hit Axie Infinity, Sky Mavis has released ‘Duet Monsters’, an intriguing new mobile game. This game is made to enthrall players with its special blend of music and PvP fights, which is evocative of beloved titles like Guitar Hero and is available on both Android and iOS.\n\n‘Duet Monsters’ is a colourful world in which players manage Axies in a musical setting. Getting food that is falling—each connected to a different musical note—is the main goal. Players that accomplish this feed their Axies and also produce music, which earns them points and other in-game goodies.\nThe alpha release tournament was a major event of the game’s debut. Players can vie for valuable Origin Axie NFTs in this competition, which can be worth up to $800 each. These sought-after awards will go to the top three winners of the alpha phase, who will be ranked according to their leaderboard rankings.\nPlayers must link a Ronin wallet with at least two Axie NFTs in order to engage in earning in-game currency such as the “Smooth Love Potion” (SLP).\nBoth daily quests that change every day and the PvP mode SLP battles, which put users in musical duels against one another, are two ways to earn SLP. Moreover, in next updates, SLP earnings are supposed to be included in the leaderboard system of the game.\n\nThough future updates are anticipated to enable users to withdraw their money to their Ronin wallets, as of right now, the SLP gained can only be spent within the gaming area.\nThrough these fights, gamers may also earn “Axie Experience Points” (AXP). Nurturing the development of their Axies and improving their skills and competitiveness in the game depend on these points.\nRegarding market movements, the Axie Infinity token, AXS (Axie Infinity Shards), is now trading at $7.09, down 7.01% in the previous day. With a 6.10% rise during the previous week, it does, however, indicate a positive tendency.\nOn the other hand, as previously reported by ETHNews, the latest partnership between Animoca Brands and the Opal Foundation to create a top Web3 environment on Bitcoin that emphasizes gaming, culture, and education highlights even more how blockchain technology is integrating with the mainstream entertainment and educational industries.\n",
    "referenceLinks": [
      "https://www.ethnews.com/ronin-rockets-binance-announces-listing-for-high-flying-gaming-crypto/",
      "https://t.co/CoxdaHJflF",
      "https://twitter.com/duet_monsters/status/1789145350646722826?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/extra-mile-and-tv-asahi-group-launch-first-blockchain-games-accelerator/",
      "https://www.ethnews.com/game-on-polkadots-role-in-shaping-the-future-of-gaming/",
      "https://www.ethnews.com/animoca-hits-the-bitcoin-scene-game-changing-moves-for-web3-gaming/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/Duet-Monsters-696x392.jpg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "ARK 21Shares Modify Spot Ethereum ETF Proposal, SEC Decision Expected in May 2024",
    "category": "",
    "author": "Isai Alexei",
    "link": "https://www.ethnews.com/ark-21shares-modify-spot-ethereum-etf-proposal-sec-decision-expected-in-may-2024/",
    "creationDate": "May 11, 2024",
    "content": "ARK Invest and 21Shares revised their spot Ethereum ETF application, removing the staking component to streamline the approval process by the SEC. The decision on this application is expected by May 23, 2024. Previously, the proposal included plans for occasionally pooling the trust’s Ethereum assets through third-party providers to earn staking rewards.\n\nEliminating the staking feature is likely intended to simplify the approval process and address potential SEC concerns. Eric Balchunas, a Bloomberg ETF analyst, suggested that removing this aspect could prevent potential objections that might delay or hinder approval.\n\nThe revised ETF proposal aims to provide investors with direct access to Ethereum through trading on the Cboe BZX Exchange. It plans to use the CME CF Ether-Dollar Reference Rate—New York Variant for precise pricing. 21Shares serves as the trust sponsor, Delaware Trust Company is the trustee, and Coinbase Custody Trust Company is the asset custodian.\nThe prospects for SEC approval have diminished, with Balchunas reducing the likelihood of a favorable outcome to 25% by May’s end, down from an earlier estimate of 70%. This reflects the regulatory hesitation affecting the broader cryptocurrency ETF market, as the SEC has postponed decisions on several other proposed funds.\nGrayscale Investments has decided to retract its Ethereum Futures ETF application, shifting its attention to transitioning its Ethereum Trust into a spot Ethereum ETF.\nIf approved, ARK Invest and 21Shares’ revised ETF could impact institutional and retail investors, offering a regulated way for people to invest in digital assets through standard financial channels.\n\nThe evolving regulatory environment remains, as the SEC’s decision on Invesco Galaxy’s spot Ethereum ETF has also been postponed to July 2024. The crypto sector awaits these key decisions, which will shape how traditional financial systems adapt to cryptocurrency assets.\n\n\nThe current price of Ethereum (ETH) is approximately $2,922.41 USD. After analysing recent trends and available technical information, I expect the price of ETH to experience a moderate recovery in the near term, approaching $3,000 USD.\n",
    "referenceLinks": [
      "https://twitter.com/ARKInvest?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/SECGov?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/EleanorTerrett/status/1789040009560961386?ref_src\u003dtwsrc%5Etfw",
      "https://t.co/CeQwj5ktPn",
      "https://twitter.com/EricBalchunas/status/1789053958079619176?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/joseph-lubin-criticizes-secs-regulatory-approach-warning-of-negative-impact-on-ethereum-and-crypto-industry/",
      "https://www.ethnews.com/sec-extends-timeline-for-ethereum-etf-review-amid-market-speculation/",
      "https://t.co/cNrnFesRnD",
      "https://twitter.com/PhoenixTrades_/status/1789039265604685831?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/new-ethereum-proposal-eip-7702-introduces-stronger-security-for-smart-contract-wallets/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/ark-21shares-modify-spot-ethereum-etf-proposal-sec-decision-expected-in-may-2024-e1715391682447-696x522.jpeg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Mark Cuban Faces November 2024 Trial Over Voyager Digital Class Action Lawsuit",
    "category": "",
    "author": "Isai Alexei",
    "link": "https://www.ethnews.com/mark-cuban-faces-november-2024-trial-over-voyager-digital-class-action-lawsuit/",
    "creationDate": "May 11, 2024",
    "content": "Mark Cuban could potentially face trial in November 2024 if he fails to settle claims in the ongoing class action lawsuit related to Voyager Digital, a cryptocurrency firm. Unlike Cuban, co-defendants including sports figures Rob Gronkowski, Victor Oladipo, and Landon Cassill have decided to settle allegations connected to their promotion of Voyager Digital. They have agreed collectively to pay $2.4 million.\nThe settlement, if approved by the court, would leave Cuban and his basketball team, the Dallas Mavericks, as the sole defendants proceeding to trial later this year. This was highlighted in a recent court filing which stated,\nIn 2021, Cuban and the Dallas Mavericks entered into a five-year promotional agreement with Voyager Digital. Leveraging Cuban’s prominence and the Mavericks’ fan base, Voyager was able to attract a substantial number of customers.\nRead more: Jamie Dimon Criticizes Bitcoin While JPMorgan Invests in Bitcoin ETFs\nHowever, the company’s bankruptcy in 2022 resulted in significant financial losses for investors, prompting the class action lawsuit. The plaintiffs, who are former customers of Voyager, allege that Cuban’s promotion negatively impacted approximately 3.5 million people, with total losses exceeding $5 billion.\nAmong the sports figures who settled, Rob Gronkowski had a particularly extensive promotional deal with Voyager Digital, acting as a brand ambassador and token holder. His role in the firm’s marketing initiatives led him to contribute $1.9 million to the settlement—a higher amount compared to Oladipo and Cassill.\nRelated: Joseph Lubin Criticizes SEC’s Regulatory Approach, Warning of Negative Impact on Ethereum and Crypto Industry\nThe legal challenges facing Cuban and the Dallas Mavericks underscore the risks associated with high-profile endorsements of cryptocurrency firms. As the situation unfolds, it will be interesting to see whether Cuban opts to seek a settlement or proceed with the scheduled trial in November 2024. This case serves as a critical reminder of the potential liabilities that can arise from the endorsement of volatile financial products by influential figures.\n",
    "referenceLinks": [
      "https://www.ethnews.com/jamie-dimon-criticizes-bitcoin-while-jpmorgan-invests-in-bitcoin-etfs/",
      "https://www.ethnews.com/joseph-lubin-criticizes-secs-regulatory-approach-warning-of-negative-impact-on-ethereum-and-crypto-industry/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/mark-cuban-faces-november-2024-trial-over-voyager-digital-class-action-lawsuit-e1715384266177-696x522.jpeg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "US Government’s Approach to Tether: Ripple CEO Brad Garlinghouse Shares Insights",
    "category": "",
    "author": "Isai Alexei",
    "link": "https://www.ethnews.com/us-governments-approach-to-tether-ripple-ceo-brad-garlinghouse-shares-insights/",
    "creationDate": "May 11, 2024",
    "content": "In an interview on the “World Class” podcast, Ripple CEO Brad Garlinghouse highlighted his concerns about the U.S. government’s intentions towards Tether, the leading issuer of the USDT stablecoin. He said, “The U.S. government is going after Tether. That is clear to me.” Garlinghouse emphasized Tether’s importance in the cryptocurrency market while expressing uncertainty over the effects of government action on the industry.\nGarlinghouse, Ripple’s CEO since 2016, recounted his initial doubts about Bitcoin’s ability to replace traditional banking in 2012, leading him to align with Ripple’s approach of integrating cryptocurrencies into existing financial systems.\nHe chose to work with Ripple over joining Uber after learning about the “Internet of Value” concept from Ripple co-founder Chris Larsen and recognizing the potential of the XRP token.\nDuring the interview, Garlinghouse admitted that leading Ripple had been challenging and lonely compared to his time at Yahoo when he had more colleagues. He described the emotional toll of facing a lawsuit by the U.S. Securities and Exchange Commission (SEC) and said that Ripple employees felt united because the company was transparent about its legal battle.\n\nHe breaking down in tears when Ripple partially won the lawsuit against the SEC on July 13, 2023, marking a high point for the company and its staff.\nDespite the regulatory hurdles, Garlinghouse is optimistic about the future of cryptocurrency, noting that the SEC’s attempts to regulate the industry would likely fail over time. He believes that current regulatory issues are temporary challenges and dismissed the potential threat of quantum computing to the sector.\nThis interview provides insight into Garlinghouse’s views on the complexities of the cryptocurrency industry while reflecting the ongoing regulatory scrutiny faced by prominent companies like Ripple and Tether.\n\n\n\nThe current price of Ripple (XRP) is approximately $0.5034 USD. Based on recent technical analysis and market trends, I expect the price of XRP could rise slightly in the coming weeks, potentially reaching around $0.55 USD.\n",
    "referenceLinks": [
      "https://www.ethnews.com/ripple-projects-3-trillion-stablecoin-market-with-upcoming-usd-backed-coin/",
      "http://and-robinhood/",
      "https://twitter.com/Ripple?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/bgarlinghouse/status/1788971427258871981?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/ripple-ceo-clears-air-on-xrps-status-as-company-plans-stablecoin-release/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/us-governments-approach-to-tether-ripple-ceo-brad-garlinghouse-shares-insights-xrp-e1715379100616-696x522.jpeg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Jamie Dimon Criticizes Bitcoin While JPMorgan Invests in Bitcoin ETFs",
    "category": "",
    "author": "Isai Alexei",
    "link": "https://www.ethnews.com/jamie-dimon-criticizes-bitcoin-while-jpmorgan-invests-in-bitcoin-etfs/",
    "creationDate": "May 10, 2024",
    "content": "JPMorgan Chase, the largest U.S. bank, disclosed its Bitcoin exchange-traded fund (ETF) holdings in a recent report. Despite having just $1.2 million in Bitcoin ETFs, this suggests a broader trend of acceptance for the cryptocurrency among major financial institutions.\n\nRobert Mitchnick from BlackRock noted that large investors, including pension funds, are beginning to explore Bitcoin ETFs. Mitchnick said that despite a slowdown in new investments, demand for Bitcoin exposure remains high.\nOther financial institutions are also investing in Bitcoin ETFs. Edmond de Rothschild (Suisse) S.A. owns $4.2 million in shares, and Wells Fargo has also disclosed its Bitcoin ETF holdings.\n\nHowever, JPMorgan’s CEO, Jamie Dimon, continues to be skeptical about Bitcoin. In December, he suggested that the U.S. government should shut down Bitcoin, calling it a “Ponzi scheme.”\n\nDespite his opposition, JPMorgan created a passively managed Bitcoin fund for its wealthy clients in 2021. The bank was also listed among authorized participants for BlackRock’s record-setting Bitcoin ETF last year.\nBitcoin ETF activity showed varied results on Thursday. Grayscale’s Bitcoin Trust (GBTC) reported outflows of over $43 million, while BlackRock’s relatively smaller inflows of $14.2 million weren’t enough to balance them. Still, Bitcoin prices temporarily rose to $63,000 before declining.\nThese financial developments highlight that traditional financial institutions are slowly adapting to digital assets despite differing opinions on their stability. JPMorgan’s involvement reflects this gradual shift, even though its CEO remains critical. Ultimately, these contrasting attitudes show the varying views within traditional finance on the future of cryptocurrencies.\n",
    "referenceLinks": [
      "https://t.co/CllRcYuoUW",
      "https://twitter.com/PhoenixTrades_/status/1789018590206669258?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/blackrocks-investment-fuels-growth-in-tokenization-space/",
      "https://www.ethnews.com/bitcoin-halving-day-sees-blackrock-etf-register-69-straight-days-of-inflows/",
      "https://twitter.com/hashtag/Bitcoin?src\u003dhash\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/BitcoinMagazine/status/1789012487678914606?ref_src\u003dtwsrc%5Etfw",
      "https://www.ethnews.com/blackrock-bitcoin-etf-flows-dry-up-amidst-market-concerns/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/05/Jamie-Dimon-e1715376448925.jpeg"
  },
  {
    "websiteSource": "https://www.ethnews.com/",
    "type": "News",
    "title": "Web3 Made Easy: How Chainlink Eliminates Blockchain Barriers for Users and Enterprises",
    "category": "",
    "author": "Isai Alexei",
    "link": "https://www.ethnews.com/web3-made-easy-how-chainlink-eliminates-blockchain-barriers-for-users-and-enterprises/",
    "creationDate": "May 10, 2024",
    "content": "Chainlink plays a central role as the Web3 Abstraction Layer, aiming to facilitate the integration of $280 trillion in digital assets into blockchain networks.\nKnown as the largest oracle network, Chainlink provides tools such as Data Feeds, the Cross-Chain Interoperability Protocol (CCIP), and Any API. These form the Abstraction Layer, which has been regarded as one of the most important advancements in blockchain technology since Bitcoin and the Ethereum Virtual Machine.\n\nIn Web2, users navigate the internet seamlessly without concerning themselves with the technical details of servers and connections. However, Web3 lacks this simplicity. For example, buying a new token requires understanding which blockchain it was issued on, which wallets are compatible, where to buy the native tokens for transaction fees, and where liquidity is concentrated. This complexity affects not just individual users but also businesses.\nCompanies generally prefer simpler operations. They are more inclined to hire a manager to oversee contractors rather than manage them directly. In Web3, they seek a similar simplicity, preferring a unified gateway rather than interacting separately with each blockchain.\nIn Web2, connecting to WiFi grants access to all websites and apps. Chainlink aims to replicate this ease of use in Web3 by allowing users to connect to its network and seamlessly interact with any decentralized application (dApp) across various blockchains without technical complications like RPCs or Chain IDs.\nChainlink offers a universal gateway to Web3 technology for businesses, providing them with more efficient ways to interact with digital infrastructure. The markets accessible through this gateway include:\nThe Chainlink Abstraction Layer simplifies asset tokenization, purchase, and transfer across blockchains, abstracting the complexities associated with these processes. It allows both individuals and businesses to use blockchain technologies without needing detailed technical knowledge, encouraging broader adoption and streamlined integration.\nChainlink’s Cross-Chain Interoperability Protocol (CCIP) is building the infrastructure for Web3, aiming to facilitate direct communication between different blockchain networks. Similar to foundational internet protocols like TCP/IP, CCIP enables seamless connectivity and data sharing across blockchain systems using a common messaging standard.\nCCIP allows smart contracts to transfer data and tokens between blockchains securely. It offers developers the flexibility to encode and decode data in various ways. The protocol also uses Chainlink’s established network of oracle nodes, known for their reliability and security in the decentralized finance (DeFi) sector.\nCCIP’s security architecture is carefully designed with multiple components to protect the system’s integrity. In the event of component failure, no data or tokens are transmitted, safeguarding the network.\nThe protocol can significantly impact Web3 applications in the following areas:\n\nCCIP enables the creation of cross-chain non-fungible tokens (NFTs), providing a unified solution that allows NFTs to function on various blockchains. This simplifies user access to NFTs across different networks.\nFor decentralized autonomous organizations (DAOs), CCIP can facilitate voting across multiple blockchain networks, collecting the results on a main chain where governance contracts reside. This approach can reduce costs, improve participation, and maintain transparency.\nCCIP supports cross-chain lending, letting users deposit collateral on one blockchain and borrow tokens from another. Users can leverage more secure networks for collateral while borrowing at potentially lower interest rates across chains.\nThe protocol simplifies blockchain interactions by supporting smart contract wallets that can perform cross-chain functions. This process hides technical complexities, making it easier for users to navigate the blockchain ecosystem.\n\nBy enabling direct communication across blockchains, CCIP aims to make Web3 infrastructure more interconnected and practical, opening up new possibilities for blockchain applications and trade.\n\n\nThe current price of Chainlink (LINK) is approximately $13.92 USD.\n",
    "referenceLinks": [
      "https://www.ethnews.com/chainlink-labs-partners-with-rd-technologies-to-enable-secure-transparent-hkd-stablecoin/",
      "https://www.ethnews.com/enhanced-security-ahead-chainlink-partners-with-cyfrin-for-top-notch-audits/",
      "https://www.ethnews.com/vertex-protocol-partners-with-chainlink-data-streams-on-arbitrum-for-enhanced-trading-safety/"
    ],
    "pictureLink": "https://www.ethnews.com/wp-content/uploads/2024/02/chainlink5-696x369.png"
  }
]
