[]
[
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Solana Price Prediction as CEO Yakovenko Previews Post-Firedancer Era – Is SOL Set to Lead in Web3?",
    "category": "Solana, Solana News",
    "author": "Arslan Butt",
    "link": "https://cryptonews.com/news/solana-price-prediction-as-ceo-yakovenko-previews-post-firedancer-era-is-sol-set-to-lead-in-web3.htm",
    "creationDate": "May 11, 2024",
    "content": "\n\nSolana (SOL/USD) is trading at $145.88, experiencing a minor decline of 1.50% in the last 24 hours. Amidst this fluctuation, CEO Anatoly Yakovenko shared a bullish outlook for Solana‘s role in the Web3 space at the Solana Crossroads 2024 conference.\nWith the upcoming release of Firedancer, Solana’s new client, the network aims to enhance its transaction capabilities and efficiency significantly. This advancement could potentially elevate Solana’s market position, influencing the Solana price prediction as it prepares to lead in the Web3 era.\nAt the Solana Crossroads 2024 conference, Anatoly Yakovenko, CEO of Solana Labs, shared his vision for the network’s advancement beyond its “mainnet beta” phase with the impending release of Firedancer. This new client, developed by Jump Crypto, is set to boost Solana’s transaction capabilities and overall efficiency by introducing an alternative to its existing single-client system, aiming to bolster network stability.\n\nYakovenko stressed the benefit of diversifying client development to reduce bug risks and expressed optimism about Firedancer’s deployment before the Solana Breakpoint conference in September.\nDespite facing challenges like network outages and centralization critiques, Solana continues to handle a high volume of transactions. The network’s endurance through rigorous testing by various applications, including memecoins and NFTs, has been instrumental in fine-tuning its operations.\nYakovenko also detailed ambitious plans for Solana to host over $1 trillion in stablecoins within five years, underscoring a commitment to scaling at the base layer of the blockchain, in stark contrast to Ethereum’s multi-layered scaling strategy.\nHe highlighted ongoing hardware innovations from companies such as Taiwan Semiconductor Manufacturing Company and Nvidia as crucial support for Solana’s scalability goals, positioning it for a significant role in the future of blockchain technology.\nKey Takeaways:\nFrom a technical perspective, Solana’s pivotal price point is $140.89. Should the price ascend, the immediate resistance level is at $155.33, followed by higher barriers at $166.83 and $175.83. These levels could curb upward movements unless significant buying pressure emerges.\n\nConversely, the support framework begins at $132.31, with further floors established at $122.20 and $112.48. These markers are crucial for Solana, as they represent potential reversal zones if the price trajectory dips.\nThe Relative Strength Index (RSI) currently sits at 42, reflecting a bearish momentum. Additionally, the 50-day Exponential Moving Average (EMA), located at $146.39, is slightly above the current trading price, reinforcing it as a resistance level.\nIn summary, Solana faces a testing market environment. A decisive move above the $146.39 level could alter its course towards bullishness.\n“Let’s move from Solana’s ecosystem to the WienerAI presale in the AI-driven trading space.”\nWienerAI ($WAI) is an advanced AI-powered trading tool designed to revolutionize crypto trading. Its intuitive interface allows users to identify lucrative trading opportunities quickly, offering seamless transactions without the hassle of transaction fees or the risk of being outmanoeuvred by MEV bots.\nCurrently, WienerAI has embarked on its presale journey, gathering momentum with a robust initial phase that has already raised over $1.54 million out of a targeted $1.88 million. With only days remaining until the next price increment, this is a pivotal moment for potential investors.\nEach $WAI is priced at $0.000706, with investment opportunities intensifying as the platform gears up for its next strategic phases, which include expanding its reach and launching on global exchange platforms.\nDon’t miss out on securing your stake in WienerAI—invest now to take advantage of the current rate before it increases.\n\n\n",
    "referenceLinks": [
      "https://cryptonews.com/coins/sol-solana/",
      "https://cryptonews.com/price-predictions/solana-price-prediction/#:~:text\u003dOur%20Solana%20price%20prediction%20expects,hit%20a%20high%20of%20%24380.",
      "https://jumpcrypto.com/writing/jump-crypto-sets-out-to-build-new-validator-client-for-the-solana-blockchain-to-increase-the-throughput-and-reliability-of-the-network/",
      "https://twitter.com/hashtag/SolanaPricePrediction?src\u003dhash\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/forex_arslan/status/1789336217282072674?ref_src\u003dtwsrc%5Etfw"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/04/05073004/1712302204-ibet-solana-min-e1715448120173.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Erik Voorhees, ShapeShift Founder, Unveils Privacy-Focused AI Platform ‘Venice’",
    "category": "Artificial Intelligence",
    "author": "Ruholamin Haqshanas",
    "link": "https://cryptonews.com/news/erik-voorhees-shapeshift-founder-unveils-privacy-focused-ai-platform-venice.htm",
    "creationDate": "May 11, 2024",
    "content": "Erik Voorhees, the founder of popular cryptocurrency exchange ShapeShift, has unveiled his latest venture called “Venice AI.”\nThe new platform introduces a privacy-focused generative AI chatbot, addressing the growing concerns surrounding privacy in both the cryptocurrency and artificial intelligence (AI) industries.\nIn the announcement, Voorhees expressed his worries about the direction of AI, stating that he observed a trend where large tech companies, closely aligned with governments, are gaining control over AI technologies.\nHe said that this could lead to a dystopian future and advocates for open-source decentralization as a countermeasure.\nVoorhees aims to provide users with an alternative choice by offering open-source AI solutions.\nBack in 2014, Voorhees launched the ShapeShift cryptocurrency exchange.\nHowever, in July 2021, the exchange announced its transition into an open-source decentralized exchange (DEX), with control being transferred to the ShapeShift DAO.\nFollowing a battle with the Securities and Exchange Commission, ShapeShift agreed to pay a fine and comply with a cease-and-desist order, leading Voorhees to shift his focus towards building a permissionless, decentralized AI model.\n\nVenice AI, the latest product from Erik Voorhees, prioritizes user privacy. It does not store user data or have access to user conversations.\nInstead, user input is sent through an encrypted proxy server to a decentralized GPU, which runs the AI model and returns the answer.\nThis process ensures security and anonymity, as the GPU only sees the specific prompt and not the user’s entire conversation.\nVenice AI’s model is designed to be substantially better than the current status quo, where centralized companies store and retain user conversations tied to their identities.\nThe AI industry’s top players, such as Microsoft, Google, OpenAI, and Meta, have made efforts to improve the perception of generative AI by promoting responsible AI practices.\nHowever, Voorhees argues that once a company has access to user information, it cannot be trusted to delete it permanently.\nVenice AI addresses this concern by avoiding central repositories altogether. Chat history is stored locally in the user’s browser and can be deleted at any time, even without creating an account.\nWhile creating an account offers certain advantages, such as higher message limits and the ability to modify prompts, users can also access additional features by subscribing to a Venice Pro account.\nCurrently priced at $49 annually, Venice Pro provides unlimited text prompts, removes watermarks from generated images and document uploads, and allows users to turn off Safe Mode for unrestricted image generation.\nAlthough Venice AI does not yet accept digital currencies for Venice Pro subscriptions, Voorhees confirmed that this feature is coming soon.\n\nIn the meantime, users holding the Morpheus token will be rewarded with a free Pro account indefinitely.\nThe platform integrates with MetaMask wallets, offering users a seamless experience.\nWhile Venice AI is built on the decentralized Morpheus network, Voorhees acknowledges concerns regarding its performance.\nHe noted that it is important that AI solutions are on par with centralized companies to ensure user adoption.\n",
    "referenceLinks": [
      "https://moneyandstate.com/blog/the-separation-of-mind-and-state",
      "https://cryptonews.com/news/sec-accepts-shapeshifts-275000-settlement-over-crypto-securities-charges.htm",
      "https://t.co/m2jsJuDuXS",
      "https://t.co/lPIDpgI9K1",
      "https://twitter.com/ErikVoorhees/status/1788955538933575932?ref_src\u003dtwsrc%5Etfw",
      "https://t.co/m2jsJuDuXS",
      "https://t.co/qlt0xp0aC9",
      "https://twitter.com/ErikVoorhees/status/1789068670087626888?ref_src\u003dtwsrc%5Etfw"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/11094812/1715420892-1715420803229_processed-1.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Bitcoin Price Prediction as BTC Hits $60k After FED’s Rate Cut Comments – What’s Next?",
    "category": "Bitcoin, bitcoin news",
    "author": "Arslan Butt",
    "link": "https://cryptonews.com/news/bitcoin-price-prediction-as-btc-hits-60k-after-feds-rate-cut-comments-whats-next.htm",
    "creationDate": "May 11, 2024",
    "content": "Bitcoin (BTC/USD) recently crossed the $60,000 threshold, only to face new challenges from Federal Reserve sentiment. The cryptocurrency, currently trading around $60,800, experienced a modest drop of about 1.50% over the last day, keeping the bitcoin price prediction bearish.\nThis market movement aligns closely with remarks from Federal Reserve Governor Michelle Bowman, as reported by financial journalist Walter Bloomberg, indicating that rate cuts are not seen as necessary this year.\n\nThese comments from a Fed official have injected a note of caution into the market, moderating expectations that had been buoyed by the possibility of looser monetary policy.\nWith this backdrop, investors are closely monitoring further economic updates to gauge potential shifts in Fed strategy that could influence Bitcoin’s market dynamics in the upcoming months.\nBitcoin (BTC/USD) is trading at $60,800, marking a decline of around 1.50% over the last 24 hours. Given this slight decline, the market seems concerned about Bitcoin price prediction.\nYet, BTC continues to be the most valuable cryptocurrency, with a market capitalization of about $1.2 trillion. The trading volume within this period has reached a substantial $22 billion, reflecting the high level of activity in the Bitcoin market.\nFrom a technical perspective, Bitcoin’s key pivot point is $60,975. Immediate resistance is found at $63,400, with further barriers at $65,050 and $67,160. These levels will need to be surpassed for Bitcoin to regain bullish momentum.\nConversely, immediate support lies at $59,075. If this level fails to hold, subsequent support levels at $56,640 and $54,400 will become the focal points for potential bearish pressure.\nThe Relative Strength Index (RSI) is currently at 38, suggesting a potential oversold condition but also indicating that there might be further downside if market sentiment does not improve. Moreover, the 50-day Exponential Moving Average (EMA), positioned at $62,151, is providing significant resistance.\nIn summary, Bitcoin currently shows a bearish trend as it trades below the critical pivot point of $60,975. Maintaining this position might result in additional decreases, potentially reaching the support level of $59,075.\n\n\nDogeverse, the rapidly expanding meme coin network that spans multiple blockchains, including Ethereum, BNB Smart Chain, Polygon, and soon Solana, Base, and Avalanche, has made a notable splash in the cryptocurrency world. The project has successfully raised over $15 million, surpassing its initial goal of just under $13 million. Currently priced at $0.00031, Dogeverse is set for a price increase in less than a day.\nThis broad expansion aims to blend the popular Doge appeal with superior blockchain capabilities, promising greater utility and wider adoption. With the launch imminent, this is your last chance to invest in Dogeverse at the current rate.\n\nFor more updates and to engage with the community, follow Dogeverse’s official channels on Twitter and Telegram.\n\n\n",
    "referenceLinks": [
      "https://cryptonews.com/price-predictions/",
      "https://twitter.com/DeItaone/status/1788963686716997811?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/coins/bitcoin/",
      "https://cryptonews.com/coins/",
      "https://twitter.com/The_DogeVerse"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/11144502/1715438702-11.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "EigenLayer Launches EIGEN Token Airdrop, Tokens Remain Non-Transferable",
    "category": "Ethereum, Ethereum staking",
    "author": "Ruholamin Haqshanas",
    "link": "https://cryptonews.com/news/eigenlayer-launches-eigen-token-airdrop-tokens-remain-non-transferable.htm",
    "creationDate": "May 11, 2024",
    "content": "Ethereum restaking protocol EigenLayer has initiated its token-claim process, commonly referred to as an “airdrop,” for Season 1, Phase 1 rewards.\nAccording to a recent blog post by the protocol’s development team, users who are eligible for the new EIGEN token can now acquire it through the claims process after a few weeks of anticipation.\nHowever, it’s important to note that EIGEN tokens are currently nontransferable, meaning users cannot sell or trade them.\nThe blog post further mentioned that the EIGEN token will become transferable once the development team implements new features in the upcoming months.\nThe tentative target date for these implementations is set for September 30.\nIt’s crucial for users to claim their tokens before the claim process closes on September 7, as any unclaimed tokens after that date will not be distributed.\nAccording to EigenLayer’s documentation, the EIGEN token is not available for users in over 30 jurisdictions, including the United States, Russia, China, and Canada.\nAdditionally, most VPN server addresses are prohibited from being used for token claims.\nThe current claims process has unlocked 6.05% of the total supply of EIGEN tokens, and an additional 0.7% will be unlocked in mid-June during “Phase 2.”\nAt that time, users of applications such as Kelp, Pendle, Equilibrium, and similar apps will be eligible to claim their tokens.\nThe ongoing airdrop primarily caters to users who restaked Ether or its liquid staking derivatives on EigenLayer before March 15.\nUsers who hold liquid restaking tokens (LRTs) can also claim their rewards now, as long as their activities do not fall under “Phase 2.”\nAdditionally, users who restaked on EigenLayer between March 15 and April 29 are eligible to claim 100 bonus tokens immediately, with the majority of their claims becoming available in mid-June alongside other Phase 2 participants.\nThe EIGEN airdrop has sparked controversy within the decentralized finance (DeFi) community. Leandro Schlottchauer, co-founder of Kuyen Labs, stated that it might be one of the last “life-changing airdrops.”\nConversely, many EigenLayer users have criticized the airdrop for its ban on VPN servers, the distribution of nontransferable tokens, and its perceived short snapshot period.\nAs airdrop season rages on, LayerZero Labs, a renowned cross-chain interoperability protocol, has vowed to tackle the issue of sybil farmers ahead of its highly anticipated airdrop.\nThe project has stated that it will conduct an internal investigation to identify and exclude sybil farmers from receiving allocations in its future token generation event.\nAdditionally, the project plans to launch a reward program, offering a 10% bonus of the intended token allocation to bounty hunters who identify additional sybil users.\nLayerZero Labs recently completed the first snapshot for its highly anticipated airdrop.\nIn December, the project announced its plans to distribute tokens to early adopters in the first half of 2024.\n",
    "referenceLinks": [
      "https://blog.eigenfoundation.org/claims-s1-p1/",
      "https://cryptonews.com/news/layerzero-labs-vows-to-exclude-sybil-farmers-from-upcoming-airdrop.htm",
      "https://cryptonews.com/news/layerzero-airdrop-snapshot-completed-zro-token-coming-soon.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/11090907/1715418546-1714992692-1714992683316_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Wells Fargo Banks Has Invested $143 Million In Bitcoin, Filing Reveals",
    "category": "Bank, Bitcoin ETF",
    "author": "Andrew Throuvalas",
    "link": "https://cryptonews.com/news/wells-fargo-banks-has-invested-143-million-in-bitcoin-filing-reveals.htm",
    "creationDate": "May 10, 2024",
    "content": "Wells Fargo, the third largest bank in the United States, has invested in one of the country’s new Bitcoin ETF products.\nAccording to a 13F-HR form submitted on Friday, the bank held exposure worth $143 million across three different Bitcoin investment products as of March 31.\nThe vast majority of those funds were held with the Grayscale Bitcoin Trust (GBTC) – a Bitcoin spot ETF whose shares are designed to track Bitcoin’s spot price during traditional stock market hours. The fund directly backs its shares with a fixed amount of BTC, which gradually declines over time due to management fees.\nThe other two Bitcoin-related investments include a $99,000 position in the Bitcoin ATM provider Bitcoin Depot and a $1.2 million position in the ProShares Bitcoin Strategy ETF (BITO), a Bitcoin futures ETF.\nThe total position represents just a drop of Wells Fargo’s $603 billion in assets under management and has likely shrunk alongside Bitcoin’s price since the reporting period.\nNevertheless, the crypto community has hailed the bank’s allocation as a massive step toward institutional Bitcoin adoption.\nBack in 2018, the same bank temporarily banned crypto credit card purchases, but its analysts came to recognize Bitcoin’s rapid adoption growth and price appreciation over the coming years.\n\nWells Fargo began offering Bitcoin ETFs as an investment option in February for clients who specifically requested the product. Since launching in January, U.S. Bitcoin spot ETFs have absorbed $11.8 billion of net inflows.\nOther major financial institutions have also disclosed substantial allocations to Bitcoin ETFs in previous weeks. So far, the largest known owner of the products is Susquehanna International Group, an investment firm with $438 billion AUM holding $1.8 billion in Bitcoin ETFs.\nInterestingly, both Wells Fargo and Susquehanna invested most heavily into GBTC, which is the most expensive of all its competitors. The fund charges 1.5% per year in management fees, compared to a 0.3% management cost from most other rivals like BlackRock and Fidelity.\nGrayscale is currently the largest Bitcoin ETF thanks to its pre-ETF launch Bitcoin stack, but only by a thin margin. The fund has suffered nearly endless outflows since January 11.\n",
    "referenceLinks": [
      "https://archive.fast-edgar.com/20240510/A32ZQ222Z22FM2F2222M2CO24D9AZZ222X62/13F_3_2024.html",
      "https://cryptonews.com/news/largest-u-s-crypto-atm-firm-reports-no-impact-on-revenues-despite-bitcoin-price-volatility.htm",
      "https://coinmarketcap.com/currencies/bitcoin/",
      "https://academicworks.cuny.edu/cgi/viewcontent.cgi?article\u003d1628\u0026context\u003dgj_etds",
      "https://cryptonews.com/news/it-early-or-too-late-invest-bitcoin-wells-fargo-3-tips-for-new-crypto-investors.htm",
      "https://twitter.com/hashtag/bitcoin?src\u003dhash\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/hashtag/Bitcoin?src\u003dhash\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/olvelez007/status/1788951098427900206?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/news/us-spot-bitcoin-etfs-see-217m-net-inflows.htm",
      "https://cryptonews.com/news/asset-manager-susquehanna-bitcoin-etfs.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10201033/1715371833-1715371820476_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Institutions Likely To Show Interest in Bitcoin DeFi Applications",
    "category": "Bitcoin, DeFi, etherem",
    "author": "Rachel Wolfson",
    "link": "https://cryptonews.com/news/institutions-likely-to-show-interest-in-bitcoin-defi-applications.htm",
    "creationDate": "May 10, 2024",
    "content": "Bitcoin (BTC) is rapidly evolving. While the Bitcoin network has primarily been used for payment transactions, current activity appears to be resembling that of Ethereum during the height of decentralized application (Dapp) projects.\nThe introduction of Bitcoin Runes and BRC-20 tokens – which emerged during the time of the fourth Bitcoin halving event – has likely sparked the evolution of Bitcoin-native decentralized finance (DeFi).\nRena Shah, VP of Products at Trust Machines – a team focused on growing the Bitcoin economy – told Cryptonews that two years ago, Bitcoin DeFi wasn’t a narrative the ecosystem was discussing.\nYet Shah noted that the emergence of staking platforms and lending protocols across the Bitcoin network has created interest among investors in transitioning assets from a store of value to a source of value.\n\n“The desire to go from a passive to a productive Bitcoin asset is real in 2024,” she said. “We have been building towards this future because we can see that Bitcoin DeFi is appealing not just to retail investors but also to institutional investors.”\nData from DeFiLlama shows that Bitcoin’s total value locked (TVL) is roughly $1.2 billion. Yet, according to Shah, nearly $1 trillion in capital is locked on the Bitcoin blockchain.\n“Even the smallest percentages of capital becoming productive in DeFi will make huge waves in the Bitcoin ecosystem,” Shah pointed out.\nThis, along with the recent approval of spot Bitcoin exchange-traded funds (ETFs) in the United States, is increasing the potential for Bitcoin DeFi applications. In particular, this will likely appeal to institutions holding Bitcoin and retail investors.\n\nTycho Onnasch, the co-founder of Zest Protocol, told Cryptonews that he believes BTC is a more institutional asset than the rest of crypto.\n“Hence, I expect institutions to play a larger part in using and bootstrapping Bitcoin DeFi,” said Onnasch.\nAlthough Bitcoin DeFi is still a relatively new concept, a number of projects seek to enable and advance the sector.\nFor example, Onnasch explained that Zest Protocol is creating a lending protocol built specifically for Bitcoin. He mentioned that the goal behind the platform is to create a permissionless financial infrastructure for BTC lending markets.\n“Zest enables users to collateralize BTC to borrow other tokens such as stablecoins,” he said. “The platform also lets users earn yield on their BTC.”\nIndeed, the primary use case behind Bitcoin DeFi applications seems to be ensuring that Bitcoin becomes a more productive asset for investors.\nDr. Chiente Hsu, Co-Founder of ALEX and XLink, told Cryptonews that Alex is a new finance layer for the Bitcoin network.\n“Our goal is to seamlessly integrate Bitcoin with layer-2 (L2) solutions and the Ethereum Virtual Machine (EVM) world,” said Hsu. “This will allow us to expand the Bitcoin economy,” said Hsu.\nFor instance, Hsu explained that investors can earn yield on their BTC by connecting a Bitcoin wallet to XLink. He noted that XLink is powered by ALEX’s automated market maker (AMM) and decentralized exchange (DEX). This will allow cross-chain swaps between Bitcoin L2s and the EVM world.\n“Bitcoin DeFi for institutions will be the pursuit of Bitcoin yield generating assets,” said Hsu.\nHsu believes this will likely be the case due to the large amount of capital on the Bitcoin network.\n“There’s well over $1 trillion in Bitcoin capital that is ‘idle’ in the sense that its value rises and falls relative to the Bitcoin spot price,” he said. “But unlike Ethereum, Bitcoin can’t be natively locked to generate a yield. This is a solution that ALEX is actively pursuing, which will enable institutions that hold Bitcoin to earn yield through their Bitcoin capital.”\nAnother interesting point is that while Bitcoin DeFi is unique, applications tend to resemble DeFi projects on Ethereum (ETH). This is important to consider, as institutions have started to show interest in many current DeFi applications.\nDigital asset management firm Fireblocks recently found increased institutional DeFi activity on the Fireblocks platform. According to the firm, there was a 75% jump in the first quarter of 2024.\nFireblocks reported that some of the most popular Dapps that institutional customers interact with across swapping, lending, staking, and bridging include Uniswap, Aave, Curve, 1inch, and Jupiter.\nJeff Yin, CEO of Merlin Chain – a Bitcoin L2 facilitating fast, cost-effective transactions with support for BTC Dapps – told Cryptonews that DEXs, derivatives, and lending are all areas where BTC has learned extensively from ETH. He added that many new protocols are emerging.\n“For example, ‘Surf’ is a derivatives trading protocol that launched on Merlin Chain and now boasts a daily trading volume of over $10 million. These are similar to their Ethereum counterparts,” said Yin.\nYin elaborated that a specific Bitcoin DeFi application would replicate one of the largest ETH DeFi protocols, Lido – which holds $28 billion and accounts for half of Ethereum’s DeFi TVL.\n“SolvBTC is currently developing an underlying BTC yield protocol,” said Yin. “Additionally, Unicross has implemented a Rune trading protocol on a BTC L2, allowing users to trade Layer 1 (L1) assets more cheaply on L2. These represent the more innovative aspects of the sector.”\nWhile Bitcoin DeFi may appear similar to Ethereum, Shah believes that decentralized finance using BTC may eventually surpass Ethereum.\n“Looking at DappRadar, Ethereum has over 600 active apps with varying volume and activity,” said Shah. “I have no reason to expect that Bitcoin DeFi cannot match Ethereum, and eventually flip it for Dapps in the ecosystem.”\nCertain solutions are also making it easier to bring Ethereum Dapps to Bitcoin.\nZack Voell, Director of Marketing at Botanix Labs, told Cryptonews that Botanix had created a “Spiderchain” that easily enables DeFi on Bitcoin.\n“Spiderchain creates a fully EVM-equivalent environment for Dapps and smart contracts on Ethereum to be copy-pasted to run natively on Bitcoin,” said Voell. “Botanix Labs is building the Spiderchain to combine the two most Lindy technologies in crypto — the EVM and Bitcoin — instead of trying to reinvent a completely new protocol or virtual machine.”\nAlthough it’s too soon to determine the fate of Bitcoin DeFi, certain challenges may slow adoption.\nFor instance, Yin pointed out that liquidity fragmentation often results from the difficulty of implementing DeFi on an L1 network. This, in turn, forces most activities to disperse across various L2 solutions, yet Yin noted that this may make it difficult to concentrate liquidity.\n“A potential solution could be to create omnichain liquidity, similar to the Stone protocol in the Ethereum ecosystem,” he said. “We look forward to future implementations like M-STONEBTC and Solv Protocol that could unify BTC L2 liquidity.”\nAdditionally, Shah mentioned that Bitcoin’s challenge is keeping the base layer secure, stable, and untampered.\n“That is where scaling becomes paramount,” she said. “A healthy and diverse L2 ecosystem will be what ultimately drives Bitcoin DeFi, as a vertical, to succeed.”\nShah added that programming environments on Bitcoin are inherently difficult since many developers from other ecosystems are less familiar with Bitcoin script.\nShe noted that one way to combat this is to create WebAssembly (WASM) or different run-time environments like Rust, Solidity, and Cosmos with L2s.\n“This approach will likely help bring new developers into the ecosystem,” she remarked.\n",
    "referenceLinks": [
      "https://cryptonews.com/coins/bitcoin/",
      "https://cryptonews.com/news/brc-20-investors-bet-big-on-highest-apy-learn-to-earn-platform-over-1m-raised-for-99bitcoins-in-explosive-new-99btc-crypto-presale.htm",
      "https://cryptonews.com/news/best-crypto-staking-platforms.htm",
      "https://twitter.com/ALEXLabBTC?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/signal21btc?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/Stacks/status/1788190621988962511?ref_src\u003dtwsrc%5Etfw",
      "https://defillama.com/chains",
      "https://cryptonews.com/news/bitcoin-etf-approval-frenzy-begins-as-sec-finally-approves-first-spot-bitcoin-funds-bitcoin-remains-unresponsive.htm",
      "https://cryptonews.com/news/crypto-lender-ledn-processes-loans-690m-institutions-retail-q1.htm",
      "https://cryptonews.com/cryptocurrency/best-crypto-wallets/",
      "https://cryptonews.com/cryptocurrency/best-defi-2-0-projects/",
      "https://cryptonews.com/news/fireblocks-defi-tools-institutions.htm",
      "https://cryptonews.com/news/lido-finance-just-hit-1m-validators-but-can-defi-really-take-over-tradfi.htm",
      "https://dappradar.com/rankings/protocol/ethereum/category/defi/13?resultsPerPage\u003d50",
      "https://cryptonews.com/cryptocurrency/liquidity-pools/",
      "https://www.techtarget.com/searchitoperations/definition/WebAssembly#:~:text\u003dWebAssembly%20(Wasm)%20is%20a%20binary,a%20client%2Dside%20web%20browser."
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10181955/1715365195-1715365132433_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Bitcoin Price Prediction: Falls to $60,620 Amid Fed Rate Cut Speculation and ETF Inflows",
    "category": "Bitcoin, bitcoin news",
    "author": "Arslan Butt",
    "link": "https://cryptonews.com/news/bitcoin-price-prediction-49.htm",
    "creationDate": "May 10, 2024",
    "content": "Today, Bitcoin is trading at $60,620, marking a 4% decrease over the last 24 hours. The cryptocurrency’s recent uplift is attributed to dovish economic data from the U.S., hinting at possible Federal Reserve rate cuts.\nThis anticipation has weakened the dollar and, in turn, boosted Bitcoin’s value. Additionally, significant inflows of $11.54 million into Bitcoin ETFs, like Grayscale and Bitwise, along with Trump’s positive remarks on cryptocurrencies, have further fueled the upward movement.\nThe latest US employment data reveals a slowing labour market, stirring optimism within the cryptocurrency sector. Recently, the US Bureau of Labor Statistics reported that initial jobless claims rose unexpectedly to 231,000 for the week ending May 3, significantly higher than the anticipated 210,000.\nThis uptick suggests a softening job market, which might prompt the Federal Reserve to consider rate cuts sooner than anticipated—a scenario that typically benefits cryptocurrencies like Bitcoin.\nInvestors are now keenly awaiting further economic reports, such as the Consumer Price Index (CPI) and Producer Price Index (PPI), to gauge future monetary policy directions.\nThis expectation fosters a bullish outlook for cryptocurrencies.\nJack Dorsey, the co-founder and former CEO of Twitter, has made a bold prediction that Bitcoin will reach at least $1 million by 2030. This forecast coincides with his recent departure from the decentralized platform BlueSky, motivated by shifts away from its original vision of true decentralization.\n\nSimultaneously, Dorsey’s fintech enterprise, Block, faces regulatory scrutiny, impacting its services like Square and Cash App. Despite these challenges, Bitcoin shows robustness in the market, maintaining a price of around $61,000.\nWhile Dorsey remains optimistic about Bitcoin’s potential, the ongoing regulatory pressures and market uncertainties continue to pose significant challenges.\n\nToday, Bitcoin is priced at $60,620, witnessing a decline of around 4% within the last 24 hours. Bitcoin price prediction seems bearish as BTC is holding below $60,975. Above this pivot, immediate resistance levels are observed at $63,400, followed by $65,050, and extending to $67,160, which may challenge further upward movements.\nConversely, support levels are marked distinctly, beginning at $59,075 and subsequent support at $56,640 and $54,400.\nTechnical indicators reflect a cautious outlook; the Relative Strength Index (RSI) stands at 38, indicating a potential overselling scenario. The 50-day Exponential Moving Average (EMA) is positioned at $62,325, providing a reference point for current price actions.\nBitcoin’s recent market behaviour shows a bearish engulfing pattern on the 4-hour chart, breaching the upward trendline at $60,975. This breakdown suggests potential downward pressure, targeting the immediate support level at $59,075.\nConclusion: Bitcoin’s current market stance is bearish, below the $60,975 threshold. A decisive move above this level could, however, pivot towards a bullish trend.\n\n\n\nThe 99Bitcoins presale is currently underway, offering a unique opportunity in cryptocurrency education. By participating in this ‘learn-to-earn’ platform, users can enhance their understanding of digital currencies while acquiring $99BTC tokens, which are both a reward mechanism and a gateway to premium content and community benefits.\nWith the token price set at $0.00104 each, early investors are provided a cost-effective entry point to start growing their expertise and investment simultaneously.\nAs of now, the presale has successfully raised $1,169,037, moving closer to the target of $1,892,544. With only four days and just over an hour remaining before the next stage price increase, this limited-time offer presents a critical moment for investors to buy into $99BTC and gain access to immediate staking options.\n\n\n\n",
    "referenceLinks": [
      "https://cryptonews.com/news/bitcoin-price-prediction-as-weak-u-s-jobs-data-spurs-rate-cut-hopes-will-btc-surge.htm",
      "https://cryptonews.com/news/crypto-exchange-trading-volume-declines-in-april-as-bitcoin-retreats-from-record-high.htm",
      "https://www.piratewires.com/p/interview-with-jack-dorsey-mike-solana",
      "https://t.co/pzkx48CVoz",
      "https://twitter.com/Stocktrader/status/1788915404254949728?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/coins/bitcoin/",
      "https://cryptonews.com/ext/99bitcoins"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10121257/1715343177-10.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "International Monetary Fund Tells Nigeria To Regulate Crypto Trading Platforms",
    "category": "Crypto Regulation, IMF, Nigeria",
    "author": "Julia Smith",
    "link": "https://cryptonews.com/news/international-monetary-fund-tells-nigeria-regulate-crypto-trading.htm",
    "creationDate": "May 10, 2024",
    "content": "The International Monetary Fund (IMF) recommended on May 10 that Nigeria regulate crypto trading platforms amid the African nation’s detainment of two Binance executives, according to a United Nations Thursday staff report.\n“Staff recommends that global crypto trading platforms be registered or licensed in Nigeria and subject to the same regulatory requirements applicable to financial intermediaries following the principle of same activity, same risk, and same regulation,” the report read.\nNigeria has been in a financial crisis in recent months, with its once-dominant economy expected to plummet to fourth place on the African continent.\n\nDespite the country’s inflation hitting a near 28-year high, the IMF report stated that the country’s currency is beginning to steady.\n“The naira depreciated sharply after the unification of the official foreign exchange windows in June 2023,” the IMF noted. “Following monetary policy tightening in February and March 2024 and a resumption of FX interventions, the naira has started to stabilize.”\nNigeria has been cracking down on digital assets recently. In the coming days, the country will ban peer-to-peer payment systems in hopes of preventing manipulation.\nSome government officials have shifted the blame for the naira’s weakening to cryptocurrencies, with Nigerian Central Bank Governor Olayemi Cardoso alleging in February that $26 billion worth of illicit funds shuffled through Binance Nigeria in 2023 alone.\n“We are concerned that certain practices that go on that indicate illicit flows through a number of these entities and suspicious flows at best,” Cardoso said. “In the case of Binance, $26 billion has passed through Binance Nigeria from sources and users we cannot adequately identify.”\nConcerns have swirled over the country’s arrest of two Binance executives, Nadeem Anjarwalla and Tigran Gambaryan, on money laundering and tax evasion charges in over the crypto exchange’s operations.\nBoth Anjwarwalla and Gambaryan were in the country for policy meetings with regulators amidst tensions with the African nation.\nEarlier this week, Binance CEO Richard Teng claimed that “unknown persons” proposed a secret settlement between the crypto exchange’s employees and Nigerian officials “to make these issues go away.”\nBinance refused to engage in such a deal, leading to Anjarwalla and Gambaryan’s eventual capture. The two are due back in court for a hearing in Abuja on May 17.\nDespite questions over the legality of the Binance executives’ arrest, IMF’s latest staff report may signify a future increase in foreign crypto exchanges in Nigeria overall.\n",
    "referenceLinks": [
      "https://www.bloomberg.com/news/articles/2024-04-18/nigeria-s-economy-once-africa-s-biggest-slips-to-fourth-place?embedded-checkout\u003dtrue",
      "https://t.co/0dbNEJ2bEl",
      "https://twitter.com/Nairametrics/status/1788834724154098035?ref_src\u003dtwsrc%5Etfw",
      "https://www.pymnts.com/cryptocurrency/2024/nigeria-moves-ban-p2p-naira-crypto-trading/#:~:text\u003dNigeria%20is%20reportedly%20stepping%20up,reported%20Tuesday%20(May%207).",
      "https://cryptonews.com/news/nigerian-sec-to-meet-with-crypto-exchanges-amid-binance-execuitives-arrest-crypto-regulation-crackdown.htm",
      "https://cryptonews.com/cryptocurrency/the-most-popular-cryptocurrency-terms/",
      "https://cryptonews.com/news/richard-teng-says-tigran-gambaryan-and-binance-employees-offered-settlement-prior-to-binance-executives-detainment.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10180018/1715364018-1715364002039_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Binance and KuCoin Granted Approval by India’s Anti-Money Laundering Unit",
    "category": "Binance, India, KuCoin",
    "author": "Ruholamin Haqshanas",
    "link": "https://cryptonews.com/news/binance-and-kucoin-granted-approval-by-indias-anti-money-laundering-unit.htm",
    "creationDate": "May 10, 2024",
    "content": "The Financial Intelligence Unit of India (FIU-IND) revealed on May 10 that Binance and KuCoin successfully registered with the regulatory body on May 10.\nIt should be noted that these two exchanges were among several offshore entities that were banned last year, which included Huobi, Kraken, Gate.io, Bittrex, Bitstamp, MEXC Global, and Bitfinex.\nVivek Aggarwal, the head of FIU-IND, said the approval marks a credibility shift for the cryptocurrency industry within the country.\nAggarwal said that the unit plans to establish a working group in collaboration with the industry to review compliance guidelines related to anti-money laundering laws for virtual digital asset service providers.\nAccording to Aggarwal, the legitimacy and credibility of the industry lie in the hands of the parliament and the government as a whole.\n\nHe believes that safeguarding the Indian economy and preventing financial crimes can help businesses operating in the cryptocurrency sector gain more credibility and legitimacy within the system.\nKuCoin, the first crypto entity to pay the penalty amounting to $41,000, has already resumed its operations.\nOn the other hand, Binance is yet to resume its operations as it is expected to settle its penalty after a hearing with the FIU.\nAccording to sources familiar with the matter cited by The Economic Times, Binance is likely to face a $2 million fine.\nPrior to its ban, Binance reportedly held a dominant market share, accounting for nearly 90% of the estimated $4b in cryptocurrency holdings amongst Indian citizens.\nNegotiations have commenced between the regulator and other sanctioned platforms such as Kraken, Gemini, and Gate.io.\nMeanwhile, OKX and Bitstamp have submitted plans to exit the Indian market.\nAggarwal revealed that a total of 48 crypto entities are now registered as reporting entities under India’s Prevention of Money Laundering Act.\nThe meeting with financial journalists was the first official interaction between the FIU and the crypto industry.\nIt followed a prior meeting between Aggarwal and other FIU officials with representatives of all 48 entities.\nIndia’s stance on cryptocurrencies has been somewhat ambiguous. The imposition of strict crypto taxes in 2022 and the crypto market downturn led Indian traders to switch to international exchanges, negatively impacting the local crypto industry.\nTrading volumes shifted back to Indian exchanges after the ban on offshore entities, however.\nIndia has made it a priority to achieve global consensus on framing crypto policies as part of its G20 presidency in 2023.\nThe country successfully obtained agreement from all G20 members on global guidelines.\nIndia faced criticism for pushing for global consensus without having its own legislation in place, however.\nThe Indian government has kept a crypto bill on hold since 2021 and is expected to decide its position in the coming months.\nA senior lawmaker previously mentioned that the bill is unlikely to be introduced before mid-2025.\n",
    "referenceLinks": [
      "https://finance.yahoo.com/news/binance-kucoin-win-registration-indias-102711132.html",
      "https://cryptonews.com/news/taiwan-proposes-aml-amendments-seeks-jail-terms-and-fines-for-non-compliant-crypto-service-providers.htm",
      "https://t.co/qi9bjRPqX1",
      "https://twitter.com/RadarHits/status/1788890401560044001?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/cryptocurrency/what-is-cryptocurrency/",
      "https://m.economictimes.com/news/india/binance-kucoin-get-fiu-nod-to-register-and-trade-in-india/articleshow/110018834.cms",
      "https://cryptonews.com/news/indian-finance-minister-shares-progress-on-crypto-roadmap.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10163550/1715358949-1715358939572_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Crypto Exchange Trading Volume Declines in April as Bitcoin Retreats from Record High",
    "category": "Crypto Trading, Trading Volume",
    "author": "Ruholamin Haqshanas",
    "link": "https://cryptonews.com/news/crypto-exchange-trading-volume-declines-in-april-as-bitcoin-retreats-from-record-high.htm",
    "creationDate": "May 10, 2024",
    "content": "Trading volume on major cryptocurrency exchanges has experienced a significant decline in April, coinciding with Bitcoin’s retreat from its all-time high.\nSpot trading volume on centralized exchanges like Coinbase Global, Binance, and Kraken dropped by 32.6% to $2 trillion last month, as reported by research firm CCData.\nAdditionally, derivatives trading volume saw its first decrease in seven months, falling by 26.1% to $4.57 trillion.\nThe surge in trading volume witnessed earlier in the year, following the introduction of US exchange-traded funds investing in Bitcoin, waned due to the tightening of financial conditions in the United States.\nThe Federal Reserve’s efforts to address persistent inflation challenges contributed to this shift.\nPrior to the April 19 Bitcoin halving event, which reduced the supply of new coins by half, there was anticipation and excitement within the market.\nJacob Joseph, a research analyst at CCData, told Bloomberg that the decline in trading activity on centralized exchanges after the Bitcoin halving event aligns with patterns observed in previous cycles.\n\nHe further explained that the release of higher-than-expected Consumer Price Index (CPI) inflation data and escalating geopolitical tensions in the Middle East injected uncertainty and fear into the market.\nThese factors and negative net flows from spot Bitcoin ETFs led to major crypto assets reaching their range lows.\nThe decline in trading volumes also affected the spot market share of Binance, the world’s largest crypto exchange.\nFor the first time since September 2023, Binance’s spot market share dropped by almost 4% to 33.8%, reaching its lowest level since January, according to CCData.\n\nThe CME Group, a prominent derivatives marketplace, also experienced a decline in crypto trading volume for the first time in seven months.\nIn April, its derivatives trading volume decreased by nearly 20% to $124 billion, as reported by CCData.\nDespite the decline, Jacob Joseph mentioned that trading activity on centralized exchanges, while slower compared to its peak in March, remains at an elevated level compared to previous months.\nCentralized cryptocurrency exchanges (CEXs) like Binance experienced a large surge in trading volumes between October 2023 and March 2024, according to Bybit’s 2024 Institutional Industry Report released on April 18.\nNotably, OKX saw a 278% increase in 30-day volumes since October, followed closely by Binance, which saw a 239% surge.\nBybit exchange also demonstrated impressive growth, adding 264% to its trading volumes during the same period.\nAs confirmed by a spokesperson for Bybit, these exchanges have outpaced the industry’s average growth rate of 255%.\nThe U.S.-based exchange Coinbase also witnessed growth, albeit slightly trailing behind with a 193% increase in trading volume.\nThe CEX growth hasn’t surpassed the even more rapid expansion of decentralized exchanges (DEXs), however.\nLeading DEX Uniswap v3, for instance, saw a 320% increase in volumes during the same period, as highlighted in Bybit’s data.\nUniswap has surpassed $2 trillion in lifetime trading volume.\n",
    "referenceLinks": [
      "https://cryptonews.com/reviews/coinbase/",
      "https://cryptonews.com/cryptocurrency/bitcoin-halving/",
      "https://cryptonews.com/news/major-cexs-experience-3x-surge-in-monthly-trading-volumes-from-october-2023-bybit.htm",
      "https://www.google.com/search?q\u003dsite%3Acryptonews.com+OKX+review\u0026sca_esv\u003de54de6d9ee195691\u0026sca_upv\u003d1\u0026sxsrf\u003dADLYWIIoGOHKARepDstN3mIsDjRnDcvYeA%3A1715361303812\u0026ei\u003dF1Y-Zp6UMc6uwPAP2fG84As\u0026ved\u003d0ahUKEwje-7LpyoOGAxVOFxAIHdk4D7wQ4dUDCBA\u0026uact\u003d5\u0026oq\u003dsite%3Acryptonews.com+OKX+review\u0026gs_lp\u003dEgxnd3Mtd2l6LXNlcnAiHnNpdGU6Y3J5cHRvbmV3cy5jb20gT0tYIHJldmlld0jRAlCnAVinAXABeACQAQCYAQCgAQCqAQC4AQPIAQD4AQL4AQGYAgCgAgCYAwCIBgGSBwCgBwA\u0026sclient\u003dgws-wiz-serp"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10171825/1715361504-1715361361302_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Solana’s Fully Baked New Meme Coin Slothana ($SLOTH) Rises 107% in 24 Hours, Hits New ATH After Burn Mechanism Announcement",
    "category": "sloth, slothana, Solana",
    "author": "Tim Hakki",
    "link": "https://cryptonews.com/news/solanas-fully-baked-new-meme-coin-slothana-sloth-rises-107-in-24-hours-hits-new-ath-after-burn-mechanism-announcement.htm",
    "creationDate": "May 10, 2024",
    "content": "Friday, May 10, 2024 – Presale and early investors are now celebrating blistering returns for Solana’s hottest new pothead meme coin, Slothana. The $SLOTH token has risen 107% in the last 24 hours to hit an all-time high of $0.032, according to data by DexTools.\n$SLOTH went live at the beginning of the month after raising an eye-watering $15 million in a month-long presale that ended in April. It hit the market after tokens were airdropped to purchasers on Wednesday.\nToday, the meme coin is pumping hard. The buying momentum appears to be driven by a steady string of developments this week.\nOn Wednesday, the token airdrop concluded and $SLOTH hit the Solana-based decentralized exchange (DEX), Raydium. The team also announced through its X account that it submitted applications for listing on the two most popular crypto aggregators: CoinMarketCap and CoinGecko, a clear nod to the project’s market-capturing ambition.\nOn Thursday, the team announced it has now renounced all control of the $SLOTH smart contract. That means all tokens are now in circulation.\nFinally, today, the Slothana team revealed a new burn mechanism, whereby every time the price of $SLOTH increases by a cent, a corresponding number of dollars worth of tokens (multiplied by a million) will get burnt. If that sounds confusing, it really isn’t. Just look at the tweet:\n\n\nThis mechanism serves to increase Slothana’s scarcity, further driving value and setting the scene for potentially explosive future rallies as the token literally gets rarer as it gets pricier.\nSlothana’s trading chart over the week shows a token that began rallying hard after the airdrop concluded on the evening of May 8, UTC. The line forms textbook bullish patterns from then on, with steep upward climbs followed by brief periods of consolidation.\n$SLOTH is priced well right now, too. A Relative Strength Index of 59 and falling indicates the asset is not overbought and some healthy selling momentum is picking up to counterbalance the speculation as the token takes a breather before its next upward swing.\nIt’s likely to rocket again. In the last 24 hours, trading volumes for the $54 million market cap token hit a staggering $11.57 million between over 36,000 holders.\nThe surging demand for Slothana has led two exchanges to announce on X that they are listing the token for trading as of today. Both XT.com and Poloniex announced their new $SLOTH listings by lunchtime, UTC.\n\nPeople trust it as a meme coin that will bring them value, too. On DexTools, the token’s contract has been verified and the project has a DEXTscore of 82/99. Additionally, some 93.5% of community voters trust it, according to the token’s profile.\nClearly this fun and irreverent pothead meme coin is only gaining momentum. From a staggering launch to a feverish listing, Slothana is already one of Solana’s all-time top debuts on Solana.\nSlothana’s month-long ICO ended at the end of last month after attracting a sweltering $15 million in investments.\nAuspicious timing helped make the project a success, together with a growing appetite for meme coins that offer a different species of laughs to the gamut of Dogecoin copycats currently vying for supremacy in the sector.\nTo begin with, Slothana has countercultural roots. From the clock hands on the wall reading 4:20 to his hazed red eyes, Slothana was born overtly signaling his allegiance to the army of potheads around the world.\nIn keeping with the lackadaisical vibe, Slothana is a sloth. Like his predecessor Slerf ($SLERF), he creates space for a much more diverse meme coin sector, beyond the common run of Shiba Inu doge meme-themed coins like Dogecoin, Shiba Inu, Bonk, DogWifHat and Floki.\nImmediately after the weekend of the international stoner holiday, April 20, which was also the day of Bitcoin’s halving update, Slothana’s presale takings leapt from $10 million to $15 million.\nWith crypto’s success this year closely tied to the news cycle, two more price-driving events have Slothana holders banking on some heady post-launch rallies on the horizon.\nOn Slothana’s favorite day this year, April 20, a pre-programmed quadrennial Bitcoin software update called “the halving” made mining Bitcoin twice as hard as to get the same rewards.\nSince the market moves in step with Bitcoin, this supply shock has previously resulted in significant bull runs within a year of the last three halvings and analysts expect this year to be no different.\nWhen Bitcoin is on a bull run, so too is the rest of the market. Virtually every leading cryptocurrency tracks the price movements of Bitcoin, with late February/early March accounting for the steepest gains so far this year across many projects. Bitcoin set a new high watermark of $73,737.94 on March 14.\n\nIt’s also an exciting time to be on Solana. Crypto’s second-most commercially important blockchain is rapidly outdoing Ethereum to become the go-to blockchain for tomorrow’s biggest meme coins.\nIn relatively little time, projects like DogWifHat ($WIF), Bonk ($BONK), Book of Meme ($BOME) and Popcat ($POPCAT) have risen to become top ten market cap meme coins. The market is hungry for more, too. Some of the most hyped launches on Solana recently include the multi-chain Dogecoin-killer Dogeverse and Sealana, the all-American crypto trading Seal.\nIt’s no mystery why the network is rising. Solana is a digital economy housing over $4 billion in total value locked (TVL) across various apps and financial services, with over 1.15 million active users transacting daily and over 2,500 monthly active developers.\nOne key catalyst for Bitcoin’s rallies this year came from the fact that Bitcoin became a multi-billion dollar investment product in the US this year thanks to the January launch of 11 spot Bitcoin ETFs.\nNow, analysts suggest that spot Ethereum ETFs are coming next, on May 23 – the SEC’s first deadline to return a verdict on the latest round of spot Ethereum ETFs. Should US authorities approve the Ethereum investment products, it would be a clear sign to the world that crypto is more than just Bitcoin.\nThat could foment some explosive rallies across not only Ethereum, but also so-called “Ethereum killer” blockchains that also deploy high-functionality smart contracts, like Solana, Slothana’s native blockchain.\nSo, the $SLOTH presale window may be over, but it’s not too late to join crypto’s funniest and most subversive new meme coin crowd after the airdrop.\nVisit Slothana’s official website here.\nFollow the latest developments on Slothana’s X account.\n\n",
    "referenceLinks": [
      "https://www.dextools.io/app/en/solana/pair-explorer/7mtJbVNEtejYmCLRriwQhymZdzn4wGRFTvTZ5721b4BD?t\u003d1715347326165",
      "https://cryptonews.com/coins/sol-solana/",
      "https://twitter.com/SlothanaCoin/status/1788690147191435628",
      "https://twitter.com/search?q\u003d%24SLOTH\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/search?q\u003d%24SLOTH\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/SlothanaCoin/status/1788936141174886685?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/XTexchange/status/1788831559606489598",
      "https://twitter.com/search?q\u003d%24SLOTH\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://t.co/4hxpB6a67M",
      "https://twitter.com/Poloniex/status/1788893817799880997?ref_src\u003dtwsrc%5Etfw",
      "https://www.dextools.io/app/en/solana/pair-explorer/7mtJbVNEtejYmCLRriwQhymZdzn4wGRFTvTZ5721b4BD?t\u003d1715347326165",
      "https://cryptonews.com/coins/bitcoin/",
      "https://twitter.com/hashtag/SlothanaEmpire?src\u003dhash\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/SlothanaCoin/status/1778433277411426433?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/coins/ethereum/",
      "https://cryptonews.com/ext/dogeverse/",
      "https://defillama.com/chain/Solana",
      "https://cryptonews.com/ext/slothana",
      "https://twitter.com/SlothanaCoin"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10192547/1715369147-1715368975152_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "ADA to Rally 1,225%, XRP to Explode 260% and DOGE to Grow 250% – New Super Bullish Altcoin Forecasts Emerge",
    "category": "ADA, DOGE, XRP",
    "author": "Joel Frank",
    "link": "https://cryptonews.com/news/ada-to-rally-1225-xrp-to-explode-260-and-doge-to-grow-250-new-super-bullish-altcoin-forecasts-emerge.htm",
    "creationDate": "May 10, 2024",
    "content": "As the crypto bull market eases midway through the second quarter of 2024, analysts are stepping forward to fight the FUD with new super bullish altcoin forecasts.\nPopular crypto account Altcoin Daily was out earlier this week with a long list of forecasts.\n\nThey see Bitcoin (BTC) hitting $120,000, Ether (ETH) at $8,800, and Solana (SOL) at $720.\nThat would mark nearly 100% gains for Bitcoin, last at $60,600.\nFor Ether and Solana, that would mean 200% and 400% gains.\nPopular crypto analyst Deezy.eth was recently out with his own forecasts as well.\n\nHe sees Cardano (ADA) rallying 13.25x, or 1,225%, from its current levels of $0.445 to $5.90.\nHe also sees XRP (XRP) exploding to $1.80 and Dogecoin (DOGE) rallying to $0.50, respectively 260% and 250% rallies.\nThese super bullish altcoins forecasts are coming out during elevated FUD in the crypto market.\nMost altcoins and meme coins were pumping in February into March as Bitcoin broke to new record highs above $70,000.\nBut as optimism about/demand for spot Bitcoin ETFs subsided and macro headwinds built up, sharp corrections were seen across the market.\nWhile BTC is only down around 17% from its March record highs near $74,000, many altcoins have seen steeper drops.\nSolana is down 30%, XRP is down 32%, Dogecoin is down 37%, and Cardano is down 45%.\nThe April halving failed to trigger an immediate market rally, as is historically the case.\nPost-halving rallies in BTC don’t typically get started for 4-6 months.\nAnd this post-halving lull in the market coincides with the coming summer season, which typically brings consolidation for crypto.\nSo, immediate rallies are not to be expected. Few would deny that the market is midway through a new bull market, however.\nThat being said, 10x Research recently warned that token unlocks could hobble the altcoin rally if VCs choose to dump.\n\nAltcoin investing has a lot of potential. But so does the often-overlooked strategy of investing in crypto presales.\nCrypto investors parsing through the altcoin market for opportunities should also check out the presale market.\nHere are 20 of Cryptonews’ top picks for 2024.\nSee the 20 Crypto Presales\n\n",
    "referenceLinks": [
      "https://twitter.com/AltcoinDailyio/status/1787712632587461110",
      "https://twitter.com/hashtag/crypto?src\u003dhash\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/AltcoinDailyio/status/1787712632587461110?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/news/bitcoin-news/",
      "https://cryptonews.com/coins/ethereum/",
      "https://twitter.com/search?q\u003d%24BTC\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/deezy_BTC/status/1787842730183299572?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/coins/cardano/",
      "https://cryptonews.com/coins/ripple/",
      "https://cryptonews.com/news/altcoin-news/",
      "https://cryptonews.com/news/us-spot-bitcoin-etfs-see-217m-net-inflows.htm",
      "https://cryptonews.com/cryptocurrency/bitcoin-halving/",
      "https://twitter.com/10x_Research/status/1788148691716735280",
      "https://t.co/nICNYmtDyK",
      "https://twitter.com/10x_Research/status/1788148691716735280?ref_src\u003dtwsrc%5Etfw",
      "https://cryptonews.com/news/best-crypto-presales.htm",
      "https://cryptonews.com/news/best-crypto-presales.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10191720/1715368640-1715368628142_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "White House Plans to Nominate CFTC Commissioner Johnson for Treasury Position",
    "category": "CFTC, Kristin Johnson, White house",
    "author": "Jimmy Aki",
    "link": "https://cryptonews.com/news/white-house-plans-to-nominate-cftc-commissioner-for-treasury-position.htm",
    "creationDate": "May 10, 2024",
    "content": "The White House is reportedly set to nominate Kristin Johnson, a commissioner at the Commodity Futures Trading Commission (CFTC), to fill a top role at the US Treasury Department overseeing banks, according to a May 9 report by Bloomberg.\nAccording to the report, Commissioner Johnson is endorsed to become the Assistant Secretary of the Treasury for Financial Institutions, with the announcement expected to be made public soon.\nIf confirmed, Johnson will lead financial policies on credit unions, insurance, and consumer protection. She will work closely with the Treasury Secretary and coordinate with federal regulators and banking agencies.\nThe Assistant Secretary of the Treasury for Financial Institutions role has been vacant since Graham Steele’s departure in January 2024.\nSo far, the news of a potential crossover for Johnson has sparked concerns regarding a conflict of interest in decision-making.\nCongressman Don Meuser expressed his non-approval of the switch in an X post on May 10.\nHe argued that the commissioner’s imminent switch raises concerns about conflicting loyalties and interests for the official, which he believes could compromise the impartiality of the CFTC as an independent agency.\n\nDespite Meuser’s concerns, financial experts and observers are optimistic about Johnson’s confirmation, citing recent endorsements from influential figures such as Maxine Waters, the Congressional Black Caucus, and the top Democrat on the House Financial Services Committee.\nIn a letter addressed to President Biden on May 2, Waters highlighted Johnson’s notable achievements and experience, endorsing her for the role.\n“In her role as a CFTC Commissioner, Commissioner Johnson has prioritized maintaining the integrity of our financial markets,” Congresswoman Waters stated. “She has pushed the Commission to adopt rigorous capital, collateral, and margin standards. Commissioner Johnson is also leading the CFTC’s work on artificial intelligence (AI) and encouraging the Commission to carefully evaluate whether existing regulation is fit-for-purpose or new regulation is required.”\nWaters, who recently expressed concerns about Meta’s crypto ventures, welcomes Johnson’s nomination. She believes her “person of color” status will ensure that the US Treasury Department’s leadership reflects diversity.\nJohnson’s tenure as a CFTC commissioner has been marked by her proactive stance, drawing major attention and acclaim. Last year, she presented a series of proposals to improve the CFTC’s oversight of crypto businesses.\nNotably, her plan includes empowering the regulator to scrutinize businesses seeking to acquire 10% or more of a CFTC-regulated exchange or clearinghouse. More recently, Johnson lauded the Binance settlement, which she described as a template for how crypto businesses should operate in the US.\nThe report of Johnson’s nomination for the Treasury job follows the CFTC commissioner’s drive to address misuse and promote the regulation of artificial intelligence (AI).\nIn a speech at the Sidley Austin and Rutgers Law School Fintech and Blockchain Symposium on May 3, Commissioner Johnson proposed measures such as heightened penalties to tackle AI’s role in financial markets, including decentralized finance (DeFi).\nThe commissioner expressed concerns about AI in DeFi, highlighting how its integration into blockchain-based ecosystems could pose new challenges for supervision, compliance, risk management, and enforcement. She pointed out a key distinction with DeFi: its lack of a central authority, which sets it apart from traditional markets.\nJohnson also suggested the creation of an “AI Fraud Enforcement Task Force” comprising attorneys and investigators from various departments within the CFTC’s enforcement division and an inter-agency task force involving other regulators like the Federal Reserve and the Securities and Exchange Commission.\n",
    "referenceLinks": [
      "https://www.bloomberg.com/news/articles/2024-05-09/white-house-poised-to-nominate-cftc-s-johnson-to-treasury-role",
      "https://twitter.com/RepMeuser/status/1788730017481924819",
      "https://twitter.com/CFTC?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/RepMeuser/status/1788730017481924819?ref_src\u003dtwsrc%5Etfw",
      "https://democrats-financialservices.house.gov/news/documentsingle.aspx?DocumentID\u003d411421",
      "https://democrats-financialservices.house.gov/news/documentsingle.aspx?DocumentID\u003d411421",
      "https://cryptonews.com/news/democrat-rep-maxine-waters-raises-concerns-over-metas-continued-crypto-ventures.htm",
      "https://cryptonews.com/news/crypto-firms-should-use-binances-settlement-as-a-template-for-how-to-operate-says-cftc-commissioner-kristin-johnson.htm",
      "https://www.cftc.gov/PressRoom/SpeechesTestimony/johnsonstatement050224",
      "https://www.cftc.gov/PressRoom/SpeechesTestimony/johnsonstatement050224"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10162820/1715358500-1715351113188_processed.webp"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Cardano Price Prediction as Hoskinson Claims Biden is ‘Killing Crypto’ – Will ADA Fall to Zero?",
    "category": "ADA, Cardano",
    "author": "Joel Frank",
    "link": "https://cryptonews.com/news/cardano-price-prediction-as-hoskinson-claims-biden-is-killing-crypto-will-ada-fall-to-zero.htm",
    "creationDate": "May 10, 2024",
    "content": "The Cardano (ADA) price reversed 4% lower on Friday, once again finding strong resistance at its 21DMA and amid comments from its founder Charles Hoskinson that US President Joe Biden is trying to kill crypto.\nADA was last changing hands around $0.445, with the 21DMA at $0.467, having blocked rallies for over a week.\n\nThat’s a strong sign that bears are in control of this market.\nAs traders monitor the outlook for the Cardano price, they are also keeping comments from its founder on their radar.\nIn a broadcast on X, Hoskinson argued that the Biden administration is trying to kill crypto.\n“This November, if you vote for J. Biden as a crypto holder, understand that this administration’s intention is to destroy the US crypto industry,” he noted.\nThese claims are not without merit. Under Biden, the SEC has taken an aggressive regulation-by-enforcement approach to the crypto industry.\nThe agency’s underlying assumption is that virtually all cryptos aside from Bitcoin are actually securities, bringing them under its jurisdiction.\nThe SEC explicitly labeled ADA as a security, which weighed heavily on its price in 2023.\nThe Biden administration has been accused of conducting “operation choke point 2.0” to debank crypto firms in the US.\nThe SEC has also tried to stifle crypto through other means, including its SAB 121. The US House is challenging SAB 121, while Biden openly opposes these efforts.\nThe near-term outlook for the Cardano (ADA) price is downbeat. The cryptocurrency has found strong resistance at its 21DMA going all the way back to late March.\nWith the bears very much in control, a retest of recent lows around $0.40 looks likely.\nThe ADA price could go even lower. Adoption stories are increasing the prices of some of its rivals, like Toncoin.\nADA lacks a strong adoption story because it’s struggling to achieve any meaningful narrative, however.\nAs per DeFi Llama, Cardano’s TVL is only around $350 million, ranking 26th behind Ultron, MultiverseX, and Hyperliquid.\nThat suggests its current market cap ranking of 10th could be an overvaluation.\nWhile ADA is unlikely to go to zero, its lack of adoption and regulatory clarity could cause it to go much lower.\nWith the ADA outlook grim, investors will be looking for alternatives with a better chance of delivering short-term gains.\nAn alternative high-risk, high-reward investment strategy worth considering is getting involved in crypto presales.\nUpcoming web3 protocols frequently sell their native tokens at an early-bird discount to fund development.\nIf investors can reliably identify high-potential presales, they can make a great return.\nWith so many presales vying for investor funds, knowing where to start can be daunting.\nLuckily, the team at Cryptonews compiled a list of what they deem to be the best crypto presales.\nSee the 20 Crypto Presales\n\n",
    "referenceLinks": [
      "https://coinmarketcap.com/currencies/cardano/",
      "https://t.co/6SLqn9u2b8",
      "https://twitter.com/NfinityLabs/status/1788872435850187224?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/i/broadcasts/1lPJqbobyDlxb",
      "https://cryptonews.com/news/sec-to-ramp-up-in-enforcement-and-regulatory-actions-in-2024-new-report-reveals.htm",
      "https://cryptonews.com/news/cardano-price-is-going-to-zero-after-the-sec-says-ada-is-a-security-while-eco-friendly-crypto-ecoterra-blasts-to-new-highs-100x-potential-in-2023.htm",
      "https://www.coindesk.com/business/2023/04/28/operation-choke-point-20-is-secs-chemotherapy-for-14b-ponzi-problem-bcbs-ceo-says/",
      "https://www.sec.gov/oca/staff-accounting-bulletin-121",
      "https://cryptonews.com/news/best-crypto-to-buy-now-may-10-toncoin-render.htm",
      "https://defillama.com/chain/Cardano",
      "https://cryptonews.com/news/new-cryptocurrency.htm",
      "https://cryptonews.com/news/best-crypto-presales.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10183230/1715365950-screenshot-2024-05-10-132912.png"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "Stand With Crypto Launches PAC To Back Pro-Crypto Politicians Ahead of November Elections: Reuters",
    "category": "Donald Trump, PAC, SAB 121",
    "author": "Julia Smith",
    "link": "https://cryptonews.com/news/stand-with-crypto-launches-crypto-pac-ahead-of-2024-elections.htm",
    "creationDate": "May 10, 2024",
    "content": "Digital asset advocacy group Stand With Crypto launched its own political action committee (PAC) on May 10, according to a Friday Reuters report. The committee will support pro-crypto politicians in the lead-up to the November 2024 elections.\n“The goal is to endorse candidates and support candidates that are protecting the rights of our advocates of Stand With Crypto throughout November,” the digital asset organization’s Chief Strategist Nick Carr told Reuters.\nSo far, the group is banking a swath of diverse political candidates, including 2024 Congressional hopefuls Eddy Morales (D-OR), Shomari Figures (D-AL), and Troy Downing (R-MT), as well as Senatorial candidates Jim Justice (R-WV) and Jim Banks (R-IN).\n\nThe crypto advocacy group, launched by Coinbase just last year, has since reached nearly 450,000 members.\nNews of the launch of Stand With Crypto’s PAC comes amid recent data from the Digital Currency Group (DCG) showing one in five voters in swing states believe crypto is a key issue ahead of this year’s elections.\nCurrently, the PAC is backing both Donald Trump and Robert Kennedy in the 2024 U.S. presidential election.\nBoth candidates have taken pro-crypto stances in the past, with Trump recently announcing he will begin to accept digital asset donations for his campaign.\n\nMeanwhile, Kennedy has been a vocal advocate for virtual currencies. Just last month, the White House hopeful declared that if elected president, he would put the entire U.S. budget on the blockchain.\nThe crypto PAC has further taken a stance against current President Joe Biden, giving him an ‘F’ rating for his stringent stance against digital assets.\nJust this week, Biden announced that he would veto representatives Mike Flood (R-NE) and Wiley Nickel’s (D-NC) H.J. Res. 109, which would see Congress issue formal disapproval of the United States Securities and Exchange Commission’s (SEC) controversial SAB 121.\nThe SEC’s staff accounting bulletin has come under fire by pro-crypto lawmakers as it would require banks custodying crypto-assets to list liabilities and corresponding digital assets on their balance sheets.\n“Given that these institutions have successfully offered custodial services to the traditional financial system for decades, it only makes sense for banks and other financial entities to continue this service for digital assets,” Flood said in a recent subcommittee hearing.\n“Limiting the SEC’s ability to maintain a comprehensive and effective financial regulatory framework for crypto-assets would introduce substantial financial instability and market uncertainty,” a White House letter announcing Biden’s veto read.\n",
    "referenceLinks": [
      "https://www.reuters.com/world/us/crypto-group-with-440000-members-launches-pac-target-house-senate-elections-2024-05-10/?utm_source\u003dtwitter\u0026utm_medium\u003dSocial",
      "https://www.standwithcrypto.org/races/endorsed",
      "https://t.co/E8GVc4boOA",
      "https://twitter.com/Reuters/status/1788919799969423403?ref_src\u003dtwsrc%5Etfw",
      "https://theblockchainassociation.org/swingstatevoter/",
      "https://www.binance.com/en/square/post/7859050096882",
      "https://twitter.com/HarrisPoll?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/DCGco/status/1787815399540564259?ref_src\u003dtwsrc%5Etfw",
      "https://thehill.com/business/4611426-rfk-jr-im-gonna-put-the-entire-u-s-budget-on-blockchain/",
      "https://cryptonews.com/cryptocurrency/what-is-cryptocurrency/",
      "https://cryptonews.com/news/sab-121-resolution-by-mike-flood-wiley-nickel-gets-vote.htm",
      "https://cryptonews.com/cryptocurrency/crypto-regulations/",
      "https://www.whitehouse.gov/wp-content/uploads/2024/05/SAP-HJRes109.pdf"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10145105/1715352665-1715352646572_processed.jpg"
  },
  {
    "websiteSource": "https://cryptonews.com",
    "type": "News",
    "title": "RNDR Price Surges Following Apple Mention of Render Network’s Octane Software",
    "category": "AI, Apple, rndr",
    "author": "Thomas Musgrave",
    "link": "https://cryptonews.com/news/rndr-price-surges-following-apple-mention-of-render-networks-octane-software.htm",
    "creationDate": "May 10, 2024",
    "content": "Render Network’s RNDR token experienced a major price increase after Apple featured its Octane 3D rendering software during a May 7 iPad presentation. Apple Vice President of Platform Architecture Tim Millet delivered the unexpected exposure, sparking interest among investors and contributing to RNDR’s upward momentum.\nApple’s brief mention of Octane 3D, lasting only a few seconds within a four-minute keynote, highlighted Octane’s capabilities and its integration with Apple products.\nThe association with a tech giant like Apple instilled confidence in investors, leading them to speculate on the potential growth and adoption of Render Network’s technology. As a result, RNDR’s price surged by 11% immediately following the presentation and continued to climb in the subsequent days.\n\nSince May 8, RNDR has seen an overall 40% increase, reaching $11.54 on May 10, according to CoinMarketCap data. The surge outperformed Bitcoin price by a big margin, which experienced a more modest 6.9% gain during the same period.\nRNDR’s price growth is not an isolated incident; it reflects a broader trend within the artificial intelligence (AI) sector. Other AI-related tokens, including The Graph, Fetch.ai (FET), and SingularityNET (AGIX), have also witnessed major gains since May 6. The collective rise suggests growing investor confidence in the potential of AI technologies.\n\nThe influence of major technology companies like Apple extends beyond individual endorsements. Industry leaders, such as Nvidia, play a crucial role in the development and adoption of AI hardware and software, shaping the market for tokens like RNDR.\nMarket analysts are closely monitoring Nvidia, as its Q1 2024 earnings report, expected on May 22, could greatly influence the trajectory of AI-related tokens, including RNDR. Positive earnings and optimistic forecasts from Nvidia could further fuel investor interest and potentially drive further growth in the AI sector.\n",
    "referenceLinks": [
      "https://cointelegraph.com/news/render-rndr-cryptocurrency-price-apple-octanex",
      "https://twitter.com/search?q\u003d%24RNDR\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/search?q\u003d%24RNDR\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/search?q\u003d%24RENDER\u0026src\u003dctag\u0026ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/TheRealD0c/status/1787852638949621808?ref_src\u003dtwsrc%5Etfw",
      "https://coinmarketcap.com/currencies/render/",
      "https://cryptonews.com/news/ai-tokens-to-democratize-access-to-artificial-intelligence-models.htm"
    ],
    "pictureLink": "https://cimg.co/wp-content/uploads/2024/05/10172707/1715362027-099166d107448b3f3f6c52733e36483d.jpg"
  }
]
