[
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Bitcoin Unable to Recover Decisively, Ethereum Consolidates Below $3K (Weekend Watch)",
    "category": "Bitcoin (BTC) Price",
    "author": "George Georgiev",
    "link": "https://cryptopotato.com/bitcoin-unable-to-recover-decisively-ethereum-consolidates-below-3k-weekend-watch/",
    "creationDate": "May 12, 2024",
    "content": "The cryptocurrency market has calmed down considerably in the past 24 hours, halting the bearish assault and finding some consolidation in the process.\nBitcoin’s price is trading at around $61K on Sunday morning, while Ethereum is now firmly below the pivotal $3K level.\nAs CryptoPotato reported yesterday, Bitcoin’s price experienced a sudden correction, dropping below $61K and losing around 3.5% in a single day.\nThis seemingly had to do with a statement from a representative of the US Federal Reserve, who said that it may be too early to think about rate cuts.\nThe market has calmed down since then, and it seems that the worst is behind us.\nDid you like this market update? This is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day:\nThe bulls even attempted a recovery, but it was quickly halted at around $61.4K when sellers stepped in and pushed the price to $61K, where it currently trades.\nIt’s worth noting that despite the recent declines, the Fear and Greed index is still pointing out that the market is in a state of “greed.”\nNone of the major altcoins by means of total market capitalization has recovered from the crash the other day, but at least they are consolidating and charting ever so slight gains, as seen in the heatmap below.\nEven though the market seems to be completely painted in green, that’s just the 24-hour heatmap. On a seven-day scale, most of the cryptocurrencies are trading in the red.\nIt’s worth noting that Ethereum is now consolidating below the critical psychological level of $3K, and it’s very interesting to see if the buyers will be able to reclaim it soon.\nMeanwhile, today’s best performers are Immutable (IMX) – up 4.7%, and Ribbon Finance (RBN) – up 3.3%.\nOn the other hand, the cryptocurrencies that performed the worst are Zebec Protocol (ZBC) – down 7.8%, and Kaspa (KAS) – down 4.8%.\n",
    "referenceLinks": [
      "https://cryptopotato.com/bitcoin-crashes-below-61k-as-altcoins-take-massive-beating-weekend-watch/",
      "https://alternative.me/crypto/fear-and-greed-index/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Bitcoin Miner Marathon Digital Misses Revenue Expectations Due to Production Setbacks",
    "category": "Bitcoin Mining, Marathon Digital",
    "author": "Wayne Jones",
    "link": "https://cryptopotato.com/bitcoin-miner-marathon-digital-misses-revenue-expectations-due-to-production-setbacks/",
    "creationDate": "May 11, 2024",
    "content": "Marathon Digital, a Bitcoin mining company, fell short of revenue expectations set by Wall Street analysts in the first quarter 2024 report.\nThe firm cited adverse weather conditions and equipment malfunctions as contributing factors to the lower-than-expected performance.\nDespite a year-on-year revenue growth of 223% to $165.2 million, as disclosed on May 9, the company’s performance still trailed the projected estimate of $193.9 million by 14.80%, according to investment analyst firm Zacks.\nDuring the first quarter of 2024, Marathon Digital reported mining 2,811 BTC, valued at $176.7 million, marking a 28% increase compared to the previous year. However, this is a 34% decline from the 4,242 BTC mined in Q4 2023.\nMarathon CEO Fred Thiel addressed the company’s performance on a May 9 earnings call. He said the production setbacks were due to unexpected equipment failures, particularly transformers on third-party hosted sites, high weather-related disruptions in many locations, and utility company transmission line maintenance.\nThe firm noted that adverse weather conditions impacted its Garden City site in central Texas and other venues, including a newly acquired Texas location as of April 2. Despite these challenges, the company operated at a “record high” of 27 exahashes per second. Thiel highlighted the company’s goal of reaching 50 EH/s by year-end, which was revised upward from a target of 35 to 37 EH/s in late April.\nThiel noted that Marathon was able to adapt and overcome operational challenges in the first quarter. The firm redistributed equipment to newly acquired sites while ongoing repairs were underway.\nMarathon also introduced several new advanced products during the quarter, including Slipstream, aimed at improving Bitcoin transaction speed, and the MARA UBC 2100 control board, designed to enhance mining efficiency. Through strategic acquisitions, Marathon has expanded its mining capacity to 1.1 and currently operates at 54% of its total capacity.\nMarathon Digital reported first-quarter earnings per share of $1.26, which initially seemed significantly higher than Wall Street’s projected $0.02. However, these figures aren’t directly comparable because the company has adopted the newly-approved FASB fair value accounting rules. The mark-to-market adjustment was favorable, influenced by the substantial increase in Bitcoin prices.\nAfter the May 9 report, Marathon Digital (MARA) shares dropped about 2.19% to close at $19.65, with an extra 1% decrease in after-hours trading per Google Finance. Year-to-date, the company’s share price has fallen by 14.30% since peaking at $31.03 on February 28, 2024.\n",
    "referenceLinks": [
      "https://ir.mara.com/news-events/press-releases/detail/1357/marathon-digital-holdings-reports-first-quarter-2024-results",
      "https://cryptopotato.com/marathons-2023-bitcoin-production-surpasses-563-million-tripling-2022-output-report/",
      "https://cryptopotato.com/marathon-digital-reports-revenue-increases-of-452/",
      "https://www.google.com/finance/quote/MARA:NASDAQ"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "We Asked ChatGPT if Bitcoin Will Enter a Massive Bull Run in 2024",
    "category": "Bitcoin, Bitcoin (BTC) Price, ChatGPT",
    "author": "Dimitar Dzhondzhorov",
    "link": "https://cryptopotato.com/we-asked-chatgpt-if-bitcoin-will-enter-a-massive-bull-run-in-2024/",
    "creationDate": "May 11, 2024",
    "content": "TL;DR\nBitcoin (BTC) started 2024 on the right foot, seeing its price gradually rising in the first quarter and even hitting a new all-time high of over $73,500 in mid-March. However, the past two months have not been that successful, with the asset briefly plunging below the $60K mark and currently trading at around $63,000 (per CoinGecko’s data).\nAs such, we decided to ask ChatGPT whether a new bull run is on the horizon this year. The AI-powered chatbot claimed that predicting Bitcoin’s price behavior is quite speculative and depends on several factors.\nIt assumed that a new bull run may be triggered by technological developments, increased adoption, positive investor sentiment, public interest, geopolitical events, and whatnot.\nBesides the aforementioned factors, ChatGPT touched upon two particular elements that could trigger a BTC price resurgence: actions coming from the US Federal Reserve and the outcome of the lawsuit between Ripple and the US SEC.\nShortly after the COVID-19 pandemic, America’s central bank launched an aggressive anti-inflationary policy to decrease the inflation rate in the world’s largest economy. It introduced multiple rate hikes, which might have halted investments in riskier assets such as cryptocurrencies.\nHowever, there are some indications that the Fed may pivot from that regime later this year, a move that many BTC bulls hope for.\n“Lowering interest rates can stimulate the flow of money into Bitcoin by altering investor behavior, adjusting risk appetites. These factors combined can contribute to upward movements in Bitcoin’s price,” ChatGPT estimated.\nFurthermore, a decisive triumph for Ripple in its legal case against the SEC may fuel an overall revival for the cryptocurrency market. The companies entered into a trial phase last month, and according to some, Ripple has a better chance to emerge victorious due to the three partial court wins secured throughout 2023.\n“A win for Ripple might be seen as a defeat for potential overreach by regulatory bodies like the SEC, boosting investor confidence in the resilience of major cryptocurrencies against regulatory challenges. This could encourage both retail and institutional investors to increase their stakes in cryptocurrencies, including Bitcoin,” the chatbot concluded.\n\n\n\n\n\n",
    "referenceLinks": [],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Former Digitex Futures Exchange CEO Pleads Guilty to Violating Bank Secrecy Act",
    "category": "Digitex, Legal",
    "author": "Wayne Jones",
    "link": "https://cryptopotato.com/former-digitex-futures-exchange-ceo-pleads-guilty-to-violating-bank-secrecy-act/",
    "creationDate": "May 11, 2024",
    "content": "Founder and former CEO of Digitex Futures Exchange, Adam Todd, has pleaded guilty to willingly leading the firm to fail to establish an Anti-Money Laundering (AML) program.\nNotably, the former CEO’s plea was issued in a federal court in the Southern District of Florida on May 7.\nThe U.S. Attorney’s Office stated that Todd pleaded guilty to “willfully causing” Digitex to violate the Bank Secrecy Act. Indicted earlier this year, Todd was accused of overseeing an unregistered futures platform targeting U.S. customers from 2018 to 2022, allegedly neglecting vital Anti-Money Laundering (AML) and Know Your Customer (KYC) protocols.\nIn 2020, Todd announced that there would be “no KYC identity verification requirements of any kind” following a data breach at Digitex. It was reported that a former exchange employee stole information from user’s passports and driver’s licenses.\nAt the time, Digitex claimed to be blocking U.S. IPs and requested users to confirm that they were not based in the United States. The U.S. Commodity Futures Trading Commission (CFTC) then filed a lawsuit against Todd and Digitex in 2022. The following year, they won their case, resulting in an order for $16 million in disgorgement and penalties.\nAccording to Todd’s LinkedIn profile, he resigned as Digitex CEO in October 2022 and has been the lead developer at Digitex Games since February 2023.\nTodd is facing up to five years in prison and a $250,000 fine for his actions. However, the U.S. Attorney’s Office has not yet announced Todd’s sentencing hearing date.\nDigitex’s legal challenges add to the ongoing series of legal issues surrounding exchanges in the crypto industry, which also includes FTX and Binance.\nIn 2022, Sam Bankman-Fried, the former CEO of FTX, was arrested and extradited to the United States. Initially entering a plea of not guilty, he was placed under house arrest but subsequently remanded to jail due to allegations of witness intimidation. After a six-week trial, he was convicted and sentenced to 25 years in prison.\nConversely, Changpeng Zhao, the CEO of Binance, faced charges in 2023. He pleaded guilty and was granted bail, allowing him to remain free. Last month, he was sentenced to four months in prison.\nBankman-Fried faced seven felony charges related to defrauding investors and misusing customer funds. In contrast, Zhao faced one charge related to failing to maintain an effective Anti-Money Laundering program at Binance.\n",
    "referenceLinks": [
      "https://www.justice.gov/usao-sdfl/pr/cryptocurrency-futures-market-ceo-pleads-guilty-violating-bank-secrecy-act",
      "https://cryptopotato.com/us-government-charges-digitex-futures-exchange-ceo-with-bank-secrecy-act-violation/",
      "https://cryptopotato.com/adam-todd-digitex-futures-ceo-i-really-want-to-take-bitmex-down/",
      "https://cryptopotato.com/former-ftx-chief-sam-bankman-fried-sentenced-to-25-years-in-prison/",
      "https://cryptopotato.com/ex-binance-ceo-changpeng-zhao-receives-4-months-jail-time-for-aml-violations/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Mark Cuban Joins Calls Against Anti-Crypto Biden Administration, Slams the SEC",
    "category": "Joe Biden, Mark Cuban, Regulations, SEC",
    "author": "Martin Young",
    "link": "https://cryptopotato.com/mark-cuban-joins-calls-against-anti-crypto-biden-administration-slams-the-sec/",
    "creationDate": "May 11, 2024",
    "content": "On May 11, the American businessman and television personality said if Joe Biden loses the presidential election, “there is a good chance you will be able to thank Gary Gensler and the SEC (Securities and Exchange Commission).”\n“Crypto is a mainstay with younger and independent voters,” he said before adding that SEC Chair Gensler “has not protected a single investor against fraud.”\nThe outspoken entrepreneur didn’t stop there, adding that all the SEC has done is make it virtually impossible for crypto companies to operate in the United States, “killing who knows how many businesses and ruining who knows how many entrepreneurs.”\nIf @joebiden loses, there is a good chance you will be able to thank @GaryGensler and the @NewYork_SEC Crypto is a mainstay with younger and independent voters. Gensler HAS NOT PROTECTED A SINGLE INVESTOR AGAINST FRAUD\nAll he has done is make it nearly impossible for… https://t.co/uBKupxLhS9\n— Mark Cuban (@mcuban) May 10, 2024\n\nThe comments came in response to a May 10 Politico article reporting that Donald Trump has become the first major party presidential nominee to overtly court the crypto community.\nTrump told supporters this week that they should vote for him because of the way the Biden administration has cracked down on the crypto industry.\nKristin Smith, CEO of the Blockchain Association, said, “President Trump’s remarks signal a sea change in the importance of digital assets this election cycle,”\nCuban, who castigated the SEC in 2023, continued with a warning to Congress stating that crypto voters will be heard this election. He suggested that passing legislation specifically for crypto companies and the asset class could solve the problem for Biden before adding:\n“Or you could do the better option and assign all crypto to be regulated by the CFTC (Commodity Futures Trading Commission).”\nBitcoin environmentalist Daniel Batten agreed with Cuban, commenting:\n“Joe Biden could well be the world’s first politician to lose an election due to his party’s open hostility towards Bitcoin, and indulgence of colleagues spreading misinformation about Bitcoin.”\nCuban wasn’t the only one lashing out at the Biden administration this week. Cardano founder Charles Hoskinson lambasted the White House in a video on X on May 9.\n“A vote for Biden is a vote against the American cryptocurrency industry,” said Hoskinson, who added that the Biden administration is actively trying to “destroy the American cryptocurrency industry.”\nOthers, including Ethereum advocate Ryan Sean Adams and Stock-to-flow model creator “PlanB”, joined the calls against the anti-crypto administration.\nBiden hates crypto Biden hates the unvaccinated\n– 40% of US adults hold crypto – 20% unvaccinated in the US\nIF Trump embraces crypto AND restores basic human rights (informed consent, bodily integrity, freedom of speech) THEN he gets 50% of votes AND wins the Nov’24 elections! pic.twitter.com/sC7BvYOn1y\n— PlanB (@100trillionUSD) May 9, 2024\n\nBiden’s war on crypto has escalated in recent weeks. The SEC is now targeting larger trading companies, such as Robinhood, which received a threat of enforcement action over its crypto business this month.\nAdditionally, Biden’s office said it would veto legislation seeking to overturn SEC guidelines that discourage banks from holding crypto assets in custody.\nPro-crypto Senator Cynthia Lummis reacted to Biden’s threat to ban banks from holding crypto for their customers, stating, “We will not allow the administration to regulate tools for financial freedom out of existence.”\n",
    "referenceLinks": [
      "https://twitter.com/JoeBiden?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/GaryGensler?ref_src\u003dtwsrc%5Etfw",
      "https://twitter.com/NewYork_SEC?ref_src\u003dtwsrc%5Etfw",
      "https://t.co/uBKupxLhS9",
      "https://twitter.com/mcuban/status/1789037772050702824?ref_src\u003dtwsrc%5Etfw",
      "https://www.politico.com/news/2024/05/10/trump-crypto-biden-00157051",
      "https://cryptopotato.com/donald-trump-takes-new-approach-toward-crypto-bashes-bidens-hostile-administration/",
      "https://cryptopotato.com/mark-cuban-says-the-sec-approach-to-crypto-led-to-billions-in-losses/",
      "https://twitter.com/DSBatten/status/1789065730903638456",
      "https://twitter.com/IOHK_Charles/status/1788294144181543383",
      "https://twitter.com/RyanSAdams/status/1789000153124196672",
      "https://t.co/sC7BvYOn1y",
      "https://twitter.com/100trillionUSD/status/1788597142052835577?ref_src\u003dtwsrc%5Etfw",
      "https://cryptopotato.com/sec-slaps-robinhood-with-wells-notice-over-securities-law-violations/",
      "https://cryptopotato.com/biden-admin-to-kill-republican-bill-letting-u-s-banks-custody-crypto/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Calm Before the Storm? DOT Eyes This Level to Trigger Mass Liquidations (Polkadot Price Analysis)",
    "category": "Polkadot (DOT) Price",
    "author": "CryptoVizArt",
    "link": "https://cryptopotato.com/calm-before-the-storm-dot-eyes-this-level-to-trigger-mass-liquidations-polkadot-price-analysis/",
    "creationDate": "May 11, 2024",
    "content": "Polkadot’s recent price action has been characterized by steady but uncertain movements within a defined range, highlighting a balance between buyers and sellers.\nHowever, a decisive breakout from this range is imperative to determine its future trajectory.\nBy Shayan\nOn the daily chart, Polkadot has been trapped within a defined range, with the $6 support and the $7.5 resistance serving as significant boundaries. This sideways movement indicates a period of consolidation, during which buyers and sellers are evenly matched, leading to uncertainty about the cryptocurrency’s next move.\nAlthough there was a bullish rebound towards the upper boundary of the range, which coincided with the 200-day moving average, selling pressure emerged, resulting in a rejection.\nThis suggests that the price is likely to continue declining towards the lower boundary of the range in the short term. Nevertheless, a breakout from this range is needed to provide clarity on Polkadot’s future prospects.\nExamining the 4-hour timeframe, Polkadot has formed an ascending wedge pattern following a period of sideways consolidation between the key $6 support level and the significant resistance marked by the 0.5 Fibonacci level at $7.5.\nThis development has raised concerns about the continuation of the preceding bearish trend if the lower threshold of the wedge is breached.\nAs a result, intensified selling pressure has been observed near the crucial resistance level of $7.5, leading to a bearish reversal, with the lower trendline of the wedge serving as the next target. Should sellers succeed in breaking this critical dynamic support, a resumption of the initial bearish trend becomes increasingly likely. Conversely, if demand strengthens, continued sideways consolidation appears to be the most probable scenario.\nBy Shayan\nUnderstanding the perpetual futures market dynamics is crucial for grasping short-term price movements in cryptocurrencies like DOT. Liquidation events in this market often drive significant price shifts, particularly after periods of consolidation. Visualizing potential liquidity zones can offer valuable insights into where these events might occur.\nThe provided Binance DOT/USDT heatmap illustrates levels where large-scale liquidations could transpire. The likelihood of a liquidation cascade increases when the price approaches areas marked in yellow. Currently, a notable liquidity pool is observed above the $7.5 level. If the price reaches this region, it could trigger a significant liquidation event, leading to a rapid downturn.\nAs a result, following the ongoing consolidation phase, the price might experience a short-term pullback toward this level. However, for longer-term projections, it’s essential to analyze how the price reacts to this zone carefully. Market dynamics can shift rapidly, and nothing is guaranteed at this juncture.\n",
    "referenceLinks": [
      "https://www.linkedin.com/in/shayan-navabi-522107248/",
      "https://www.linkedin.com/in/shayan-navabi-522107248/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "BTC Price Analysis: Bitcoin’s Consolidation About to End as Major Move Seems Imminent",
    "category": "Bitcoin (BTC) Price",
    "author": "CryptoVizArt",
    "link": "https://cryptopotato.com/btc-price-analysis-bitcoins-consolidation-about-to-end-as-major-move-seems-imminent/",
    "creationDate": "May 11, 2024",
    "content": "Bitcoin’s price rally has come to a halt over the last couple of months as the market consolidates. Yet, things are about to change soon, either for the better or for the worse.\nBy TradingRage\nOn the daily chart, it is evident that the Bitcoin price has been consolidating inside a large descending channel. The midline of the channel has recently rejected the price to the downside, and the market is testing the $60K level once again.\nIf this level breaks, there is a high probability for the channel also to break down, and the price will be more likely to experience a massive drop toward the $52K support zone.\nLooking at the 4-hour chart, things seem much clearer. The price has recently tested the midline of the channel but has been rejected decisively. Yet today’s action gives us the most significant clue, as the price has been dropping aggressively.\nThe RSI also shows values below 50%, as momentum is in favor of the sellers. Therefore, things can get ugly if the $60K level breaks to the downside.\nBy TradingRage\nAs Bitcoin’s price struggles to continue its uptrend and record a new high, the bears have been taking advantage and are now seemingly staging a further decline.\nThis chart demonstrates the exchange reserve metric and its 30-day standard moving average. Rising values are usually considered bearish, as they mean that investors are depositing their coins to exchanges to sell them.\nAs the chart depicts, the exchange reserve metric has been rising, and it has climbed above its 30-day moving average. This supply from the spot market is one of the contributing factors to the recent correction.\n\n",
    "referenceLinks": [
      "https://tradingrage.com/",
      "https://tradingrage.com/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "What is BounceBit: Liquid Restaking on Bitcoin",
    "category": "Bitcoin",
    "author": "George Georgiev",
    "link": "https://cryptopotato.com/what-is-bouncebit-liquid-restaking-on-bitcoin/",
    "creationDate": "May 11, 2024",
    "content": "The concept of liquid restaking, a topic that has gained significant popularity in recent quarters, offers users the exciting possibility to extract additional value from their staked tokens.\nPredominantly, however, this has been applied throughout a variety of Ethereum-based applications.\nBounceBit, on the other hand, is delivering a BTC restaking infrastructure designed to provide a foundational layer for various restaking products.\nIn the following guide, we take a closer look at how BounceBit works, the tokenomics behind its native cryptocurrency, and more. Let’s dive in.\nBefore we explain what BounceBit does, it’s important to understand the concept of liquid restaking that we mentioned above.\nYou might be familiar with liquid staking protocols and their liquid staking tokens (LSTs). It’s a mechanism that came to prominence with protocols like Lido. Users are able to stake their ETH into Lido (or other protocols) and receive a synthetic representation of this ETH. This is a new token that’s supposed to be pegged to the value of ETH 1:1. They could then use this synthetic ETH to carry out various operations with other protocols that support it.\nLiquid restaking, on the other hand, is a process aimed at increasing the economic security of external systems. In essence, you can take your synthetic ETH (your LST) and restake it, receiving another token called a liquid restaking token.\nAs mentioned above, most of the LRT protocols are increasingly focused on Ethereum because of its Proof of Stake architecture.\nBounceBit, on the other hand, is building a BTC restaking infrastructure that’s designed to provide a layer for restaking products on the Bitcoin network.\nHow do they do it? Well, let’s find out.\n\nIn a bid to reimagine Bitcoin’s value, BounceBit proposes an infrastructure designed based on the conviction that Bitcoin should be predominantly asset-driven at the infrastructure level.\nBounceBit differentiates itself as a Proof of Stake layer one ecosystem where validators are required to stake BTC and the native BounceBit token. This establishes a dual-token security system that’s aimed at strengthening the network itself but also at improving the intrinsic value of Bitcoin by providing its holders with an active role in validating the BounceBit network.\nThe goal is to provide a symbiotic relationship between BounceBit’s native token and BTC in an attempt to create a versatile and resilient network.\nBounceBit also leverages interoperability with other networks that are EVM-compatible, incorporating staked assets such as BTCB on the “Build ‘N’ Build” (BNB) Chain and Wrapped Bitcoin (WBTC).\nNow, it’s worth noting that when t comes to generating yield on BTC – there is a very unique challenge that’s inherently different from yield-generation protocols associated with Ethereum. The Bitcoin protocols can’t yield returns when the BTC is held within multi-signature wallets. This is what BounceBit confronts by integrating a centralized finance (CeFi) approach, taking advantage of Mainnet Digital’s custody services, as well as Ceffu’s MirrorX technology stack.\nThis essentially allows Bitcoin to maintain its presence on-chain, while also engaging in trading activities on centralized exchanges.\nThose who were around in 2022 remember the transparency issues that plagued the industry through the likes of Celsius and others.\nBounceBit incorporates on-chain proof-of-reserve (PoR), while also maintaining transparent activities in a bid to restore the trust and deliver a secure platform that allows BTC holders to earn interest.\nUndoutedbly, BTC holders face the challenge of their assets being underutilized. BounceBit seeks to tackle this challenge by providing them with a means of actively engaging their assets in the thriving sectors of decentralized finance and NFTs.\nBy extension of the above, BounceBit also commits to expanding the overall utility of BTC and Bitcon’s network as a whole. The goal is to broaden the scope of opportunities for BTC holders and leverage the cryptocurrency as a major asset.\nBounceBit identifies the absence of a smart contract platform within Bitcoin’s ecosystem as limiting the overall development of dApps and works to provide one.\n\nBounceBit is building a network that leverages the well-known Proof-of-Stake (PoS) consensus algorithm to rethink conventional staking models that focus on a single token. They call this approach Dual-Token Proof of Stake (PoS).\nIn light of the above, it’s worth explaining that the protocol’s architecture incorporates a number of node operators. These can be selected as validators. These are parties that have to stake BB (the native token of BounceBit) and/or BBTC (staked BTC on the BounceBit chain). Their job is to record and verify the transactions on the network and as a reward – they receive transaction fees. As it’s a hybrid model, validators can choose to accept BBTC and/or BB tokens.\nThe purpose of accepting BTC, albeit staked, in the consensus mechanism, is to bootstrap the protocol with the deep liquidity that Bitcoin’s network has to offer, while also taking advantage of its relatively lower volatility.\nIn a bid to balance the requirements for operating the network, BounceBit empowers its validators to charge a commission on the staking rewards. This is an approach that attempts to ensure that validators are compensated appropriately for the important role that they play in maintaining the robustness and functionality of the network.\nBounceBit’s chain is fully compatible with both the Ethereum Virtual Machine and with Solidity. The latter is the programming language that’s predominantly used to create smart contracts for Ethereum. This ensures that the migration for developers would be seamless while also leveraging the proven security and abundant ecosystem of Ethereum.\nThe BounceClub takes inspiration from Apple Inc.’s strive for innovation. It is an on-chain Web3 world where users are empowered to customize, launch, and engage with various dApps.\nFor BounceClub Owners -\u003e If you meet the criteria to own a BounceClub, you will be able to select desired protocols from the BounceBit App Store and customize the space seamlessly and in a very user-friendly way. There’s a complete guide on it that you can find here.\nFor BounceClub Members -\u003e Say you’re not interested in operating a BounceClub, you can still browse the various clubs that are created by other users and engage in different Web3 activities. You would only need to get your wallet connected.\nThe main purpose of the BTC bridge within BounceBit’s ecosystem is to provide a secure way of transferring BTC between Bitcoin’s network and other EVM Chains, including BounceBit.\nIt is a critical component of the functionality and the completion of BounceBit’s vision and purpose.\nIt’s important to note that network validators are responsible for maintaining the security of the bridge. Each validator also operates a bridge node. They contribute to the signing of cross-chain messages, taking the multi-signature approach multiple steps further. You can find out more about the BounceBit BTC bridge here.\nBounceBit has a native liquid staking smart contract. If users opt-in to stake their BB or BTC, they will receive an LST (liquid staking token). These are:\nThese can be later restaked to Shared Security Clients with the aims of aggregating security and unlocking liquidity of staked assets. LSTs can be redeemed here by simply unstaking. Following the redemption request, users have to wait for 24 hours before they can claim.\nFirst things first, BounceBit’s economy is primarily composed of three types of actors, all of which are relatively self-explanatory:\nBB is the native token that powers the BounceBit platform. The total supply is capped at 2.1 billion (paying homage to the number of 21 million – Bitcoin’s capped supply.)\nBB tokens can be used in multiple ways, so we will list a few of them:\nHere’s what the token release schedule looks like:\n\nThis is the BB token distribution:\nTestnet \u0026 TVL Incentive: 4%\nInvestors: 21%\nTeam: 10%\nAdvisors: 5%\nBinance Megadrop: 8%\nMarket Making: 3%\nBounceClub \u0026 Ecosystem Reserve: 14%\nStaking Reward \u0026 Delegation Program: 35%\n\nAs you can see, the Binance Megadrop has 8% of the total supply reserved for it. It is a new token launch platform that’s designed to integrate Binance’s Simple Earn and the Web3 Wallet of the company.\nIt aims to provide users with early access to certain Web3 projects well before they are listed on the exchange.\nThe following is a step-by-step guide on how to participate in the Binance Megadrop for BounceBit.\nThere are two ways to participate, and both require a Binance account.\nYou can register one using this link and also earn a $600 welcome bonus as an exclusive deal for CryptoPotato readers!\nNow that your account is ready, the first thing you can do is navigate to the Megadrop section and lock your BNB to earn scores. From there, you can subscribe to your BNB and lock it for a certain period of time, thus earning a score.\n\nAs you can see, the longer the subscription period, the higher the multiplier is.\nThe next thing you can do is complete Web3 quests. To do so, you will need the Binance Web3 Wallet. You can create one from your Binance mobile application. Navigate to your “wallets” tab at the bottom and then tap on the “Web3” at the top.\n\nFrom here, simply follow the instructions, and your Web3 wallet will be generated. Now that your wallet is complete, navigate back to the Megadrop section and hit the “Start Quest” at the bottom – you will have to stake with BounceBit.\nFrom there on, you can follow the instructions, which will guide you toward quest completion.\nThe total score you receive will be a combination of your Locked BNB score, your Web3 quest multiplier, and will also add your Web3 quest bonus. So the formula looks like this:\nTotal Score \u003d (Locked BNB Score * Web3 Quest Multiplier) + Web3 Quest Bonus.\nIf you fail to finish all the quests, you will receive a multiplier of just 1.\nThis post has been powered by BounceBit.\n",
    "referenceLinks": [
      "https://bouncebit.io/",
      "https://cryptopotato.com/wp-content/uploads/2024/05/Screenshot-2024-05-11-at-14.52.46.png",
      "https://cryptopotato.com/wp-content/uploads/2024/05/bouncebit_cover.jpg",
      "http://v",
      "https://docs.bouncebit.io/infrastructure/btc-bridge",
      "https://docs.bouncebit.io/token/bouncebit-tokenomics/liquid-staking-token-stbbtc-and-stbb#:~:text\u003dall%20times%20on-,bbscan.io,-by%20unstaking.%20You",
      "https://cryptopotato.com/wp-content/uploads/2024/05/Picture-2.png",
      "https://cryptopotato.com/wp-content/uploads/2024/05/Picture-1.png",
      "https://cryptopotato.com/wp-content/uploads/2024/05/Picture-3.png",
      "https://cryptopotato.com/wp-content/uploads/2024/05/Picture-4.png",
      "https://cryptopotato.com/wp-content/uploads/2024/05/Picture-5.png"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Core Scientific Sees Revenue Surge in 1Q24 Post-Bankruptcy Emergence",
    "category": "Bitcoin Mining",
    "author": "Wayne Jones",
    "link": "https://cryptopotato.com/core-scientific-sees-revenue-surge-in-1q24-post-bankruptcy-emergence/",
    "creationDate": "May 11, 2024",
    "content": "The leader in Bitcoin mining has announced its financial performance for the first quarter of 2024, revealing an improvement since its emergence from bankruptcy.\nThe company reported a net income of $210.7 million compared to a net loss of $0.4 million for the same period in 2023.\nTotal revenue surged to $179.3 million, an increase from the $120.7 million recorded during the same period last year. Operating income also increased significantly, reaching $55.2 million compared to $7.6 million in the previous year. Adjusted EBITDA soared to $88.0 million, reflecting an improvement from $40.3 million in the same period in 2023.\nAdam Sullivan, CEO of Core Scientific, attributed the results to the company’s navigation of favorable market conditions and a focus on productivity and efficiency. “We delivered outstanding results in the first quarter, earning more Bitcoin than any other publicly traded Bitcoin miner,” stated Sullivan.\nThe financial results also show good performance across Core Scientific’s key revenue streams. Digital asset mining revenue surged to $150.0 million, driven by a 134% increase in the price of Bitcoin and a 20% increase in the self-mining hash rate.\nHosting revenue also increased to $29.3 million, fueled by onboarding new digital asset mining clients.\nSullivan mentioned that they’re actively considering repurposing over 500 megawatts of their operational infrastructure for high-performance computing, leveraging their access to 1.2 gigawatts of power.\nThey also plan to increase their Bitcoin mining hash rate by introducing more energy-efficient miners while simultaneously developing a high-performance computing service. Sullivan emphasized that they’re well-positioned to tap into the opportunities presented by both markets.\nThe success is due to several strategic initiatives undertaken during the quarter. The company retired $19 million in obligations shortly after the quarter’s end, strengthening its balance sheet and enhancing financial flexibility.\nCore Scientific also expanded its hosting offering by delivering 16 MW of infrastructure to high-performance compute customers ahead of schedule.\nThe company completed the deployment of 28,400 new S19j XP miners and deployed the first shipment of approximately 2,500 S21 miners while also expanding its operational infrastructure by 21 MW at its Pecos, Texas, site.\nSullivan stated that their 745 megawatts of operational, high-power data center infrastructure is key to their competitive edge. He emphasized that this advantage positions them uniquely, enabling them to leverage Bitcoin mining as a foundation for expanding into alternative compute hosting services.\n",
    "referenceLinks": [
      "https://cryptopotato.com/core-scientific-reports-yearly-revenue-decrease-in-q4-2023-net-losses-shrink/",
      "https://www.businesswire.com/news/home/20240508870784/en/",
      "https://cryptopotato.com/core-scientific-mined-over-1400-btc-in-december-despite-bankruptcy-filing/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  },
  {
    "websiteSource": "https://cryptopotato.com/",
    "type": "News",
    "title": "Bitcoin Crashes Below $61K as Altcoins Take Massive Beating (Weekend Watch)",
    "category": "Bitcoin (BTC) Price",
    "author": "George Georgiev",
    "link": "https://cryptopotato.com/bitcoin-crashes-below-61k-as-altcoins-take-massive-beating-weekend-watch/",
    "creationDate": "May 12, 2024",
    "content": "The past 24 hours haven’t treated the cryptocurrency market well, with most coins trading well in the red.\nBitcoin plummeted below $61K, while the majority of altcoins are also charting considerable losses. Let’s have a closer look.\nBTC was trading relatively flat throughout the week, failing to break out in either direction and maintaining its stance at around $63K.\nThis all changed yesterday when the cryptocurrency took a massive hit and plunged rather suddenly toward $60K.\nThe volatility induced over $200 million worth of liquidated positions over the past 24 hours and seemed to have been triggered by a statement from a representative of the US Federal Reserve.\nDid you like this market update? This is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day:\nSpeaking at a conference in New Orleans, the President of the Dallas Fed – Lorie Logan – suggested that it may be “too early to think about rate cuts.”\nI need to see some of these uncertainties resolved about the path that we’re on, and we need to remain very flexible.\nThe market didn’t take this well, and all the charts are painted in red.\nTrading at $60,800 at the time of this writing, BTC’s price is down 3.5% in the past 24 hours.\nIf that sounds bad, don’t look at the following heatmap.\nETH lost 4.1%, SOL is down 6%, and DOT crashed by almost 6% as well – similar to a lot of other coins such as BCH, AVAX, and UNI.\nAlthough prices have stabilized throughout the past few hours, market analysts are monitoring the action closely to determine whether the bears are done or if another assault is inbound.\nTheta Network (THETA), alongside THORChain (RUNE) are the coins that lost the most during the past 24 hours, down 10.8% and 9.2%, respectively.\nOn the other hand, Cheelee (CHEEL) and Akash Network (AKT) were able to curb the damage, increasing by around 3% throughout the same period.\n",
    "referenceLinks": [
      "https://cryptopotato.com/bitcoin-plummets-toward-60k-as-federal-reserve-considers-keeping-rates-elevated/"
    ],
    "pictureLink": "https://cdn.shortpixel.ai/spai/w_288+q_lossless+ret_img+to_webp/https://cryptopotato.com/wp-content/uploads/thumbs/Bitcoin_Green_MW-3jrsdtahj1jw125et4wiyy.jpg"
  }
]
